<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content=
"HTML Tidy for Windows (vers 14 February 2006), see www.w3.org" />
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Perl Viren Coding II</title>
<link rel="stylesheet" href="../../css/code.css" type="text/css" />
</head>
<body>
<hr />
<pre>
<b>[+]</b><u>Topic: Paper</u>
<b>[+]</b><u>Von: Perforin</u>
<b>[+]</b><u>Return: <a href=
"javascript:history.back()">Paper</a></u>
</pre>
<hr />
<pre>
DaRk-CoDeZDaRk-CoDeZDaRk-CoDeZDaRk-CoDeZ
DaRk-                              DaRk-       Trust my Technolust! :)
CoDeZ     Perl Viren Coding II     CoDeZ
DaRk-         by Perforin          DaRk-        www.vx.perforin.de.vu
CoDeZ                              CoDeZ         www.DarK-CodeZ.com
DaRk-CoDeZDaRk-CoDeZDaRk-CoDeZDaRk-CoDeZ
   

C:\&gt; dir /W

[Intro]            [Whitelisting]
[Outro]            [AV_Umgehen]
                   [Code_obscuring]
                   [Metamorphismus]   
                   
C:\&gt; perl Intro/Intro.pl

Hallo und Willkommen in meinem zweitem Teil, &uuml;bers Perl Viren coden.
Diesmal werde ich mehr auf die Theorie eingehen als euch einfach nur
Codes in die H&auml;nde zu dr&uuml;cken.Hier lernt ihr was &uuml;ber "Whitelisting",
"AV&acute;s umgehen", "Code obscuring" sowie "Metamorphismus".Ich hoffe
euch wird dieses Fortsetzung gefallen, auch wenn sie wohl n00b-
unfreundlicher ausf&auml;llt ;)

Greetings Perforin


C:\&gt; perl Whitelisting/whitelisting.pl

Das sch&ouml;ne am whitelisting ist, dass wir es f&uuml;r unsere Zwecke benutzen
k&ouml;nnen :) Also, im groben ist whitelisting eine Liste (Array, Hash) mit
voreingestellten Werten.Diese Werte k&ouml;nnen alles m&ouml;gliche sein.So k&ouml;nnen
diese Werte zum Beispiel, URLS sein, Ordnernamen, etc.Alles wovon wir
wissen dass es auf dem Zielsystem oder im Internet gibt.Klingt erstmal 
etwas verwirrend, doch benutze ich bei meinem Wurm "Epidemus" auch 
whitelisting.In meiner dort gebrauchten Whitelist, befinden sich Adressen
zu exploitbaren Hosts, um das HiFriend Header Injection Exploit auszuf&uuml;hren.
Der Vorteil dabei ist folgender, dass die Werte in der Whitelist von uns 
getestet wurden und auch aufrufbar oder in unserem Fall, exploitbar sind.

@whitelist = ("opfer.org","opfer2.com","opfer3.com","opfer4.com");
@whitelist1 = ("C:\","C:\WINDOWS","C:\Programme","D:\");

Whitelisting kann also dazu beisteuern dass zum Beispiel ein Wurm sich
schneller verbreiten kann, also ohne.Dies h&auml;ngt nat&uuml;rlch auch von der Gr&ouml;sse
unserer Whitelist ab.So kann diese aus einigen Zeilen in nem Array bestehen
oder sogar eine ganze Datenbank umfassen. Dabei sind eurer Kreativit&auml;t keine
Grenzen gesetzt!
Man kann davon ausgehen dass ein Wurm, mit einer  ordentlichen Whitelist sich
5x schneller verbreiten k&ouml;nnte.Dies ist dann doch schon ein ganz gewaltiger
Anstieg.Wenn die Whitelist abgegrast ist,so m&uuml;ssen wir danach auf anderem Wege,
unsere Opfer infizieren. Ich habs so geregelt, dass zuerst die Whitelist
gebraucht wird um das Exploit auszuf&uuml;hren um Emails mit meinem Wurm drin zu
verschicken.Wenn die Hosts in der Whitelist nichtmehr exploitbar sind, erst
dann kommt die Google Engine zum Einsatz.

Denkt daran, dass eine verbugte &Uuml;berpr&uuml;fung der Whitelist oder Unsinnige
Werte in der Whitelist selber, euren Wurm, Bot, Virus zu Nichte machen kann.
Doch normalerweise kann man bei sowas kaum Fehler machen...


C:\&gt; perl AV_Umgehen/av_umgehen.pl

Heutzutage sind die AntiViren Softwares nicht mehr nur auf Signaturdatenbanken
angeweisen, nein sie k&ouml;nnen etwas als Malware klassifizieren, allein durch das
Verhalten der Software.Tja, doch auch hier gibt es eine Umgehungsm&ouml;glichkeit,
die einfacher nicht sein k&ouml;nnte.Kennt ihr beim AV auch die Option, Ordner nicht
abscannen zu lassen? :D
Genau das, machen wir uns zu nutze!Als gutes Beispiel nehm ich hier mal Avira
Antivir.Avira speichert die Exception Liste, Klartext in einer Datei namens
AVWIN.INI. Diese finden wir im Ordner:
%ALLUSERSPROFILE%\Anwendungsdaten\Avira\AntiVir PersonalEdition Classic

Ganz am Schluss dieser Datei finden wir zum Beispiel folgendes:
.
.
.
[SKIPFILES]
Path0=C:\Dokumente und Einstellungen\Besitzer\Desktop\Tools

Wir brauchen also nichts weiter zu tun, als diesen Pfad zu kopieren um diesen
anschliessend als Abladestelle f&uuml;r unsere Malware zu benutzen.Sicherheitshalber
sollte man den Pfad noch abchecken, dass dieser nicht der Desktop ist, da dies
eine Art Honeypot sein k&ouml;nnte.Auch wenn nicht, w&uuml;rde sich eine weitere Datei
auf dem Desktop, die der User nicht kennt, doch etwas auffallen.
Man sollte die Datei bei jedem Bootvorgang &uuml;berpr&uuml;fen, k&ouml;nnte ja sein, dass sich
der Pfad im Laufe der Zeit mal &auml;ndert, und wenn bis dahin eure Malware irgendwie
detected sein sollte, ist unser sch&ouml;ner Plan futsch ;)

Wir k&ouml;nnen das nat&uuml;rlich auch so drehen, dass wir in die Datei einen weiteren
Pfad hineinschreiben.AntiVir meckert da kein bisschen wenn wir daran rumfummeln!
Die weiteren Eintr&auml;ge m&uuml;ssen nur weitergehend numeriert werden...
.
.
.
[SKIPFILES]
Path0=C:\Dokumente und Einstellungen\Besitzer\Desktop\Tools
Path1=C:\Programme
Path2=C:\WINDOWS\system32
Path3=D:\

Leichter kann man uns das garnicht machen =)
Wo andere AV&acute;s diese Ausnahmen speichern, findet ihr am besten mit RegMon &amp; FileMon
raus.So hab ichs auch mit Avira gemacht.Jedoch solltet ihr zuerst immer im %ProgramFiles%
Ordner des AV&acute;s nachsehen und bei den Anwendungsdaten.Dort findet ihr oft viele interessante
Dateien ;)


C:\&gt; perl Code_obscuring/code_obscuring.pl

Da wir Perl Malware schreiben wollen und es nunmal eine Skriptsprache ist, ist der
Source somit immer einsehbar, ausser vielleicht bei perl2exe oder dem PAR Modul.. obwohl
die die Dateien meistens auch nur droppen... naja, aufjedenfall wollen wir das so
nicht.Zwar kann man den Source einsehen, aber wir k&ouml;nnen unsere Malware auch so schreiben,
dass sie nicht mit dem menschlichen Auge lesbar ist.Wir k&ouml;nnten so zum Beispiel 
Verschl&uuml;sselung einsetzen, oder einfach nur Perl schreiben dass man anfangs einfach nicht
versteht was die einzelnen Zeilen machen.Code obscuring finden wir sehr oft bei JavaScript
Code, die einen iframe zu Mpack, Neopack oder irgendwelchen anderen Exploit Tools &ouml;ffnen.
Ich zeig euch hier mal ein Ausschnitt aus meinem Wurm, wo er nen Ordner erstellen soll.
.
.
($virii,$xswyaq) = (basename($0),$ENV{'windir'});
mkdir("$xswyaq".chr(hex('5C')).chr(hex('73')).chr(hex('79')).chr(hex('73')).chr(hex('74')).chr(hex('65')).chr(hex('6D')).chr(hex('33')).chr(hex('32')).chr(hex('5C')).chr(hex('4D')).chr(hex('69')).chr(hex('63')).chr(hex('72')).chr(hex('6F')).chr(hex('73')).chr(hex('6F')).chr(hex('66')).chr(hex('74')).chr(hex('7B')).chr(hex('43')).chr(hex('6F')).chr(hex('72')).chr(hex('65')).chr(hex('7D')).chr(hex('5C')),0777);
.
.

Jioa, also wer das einfach so lesen kann, dem kann ich nur gratulieren.Leider ist diese
Methode nur nicht so sicher wie sie vielleicht aussieht.Jemand der nur etwas von Perl
versteht, wird einfach das ganze wie folgt mit print ausgeben und dann zu folgender 
Ausgabe gelangen:

print "Ausgabe: "."$xswyaq".chr(hex('5C')).chr(hex('73')).chr(hex('79')).chr(hex('73')).chr(hex('74')).chr(hex('65')).chr(hex('6D')).chr(hex('33')).chr(hex('32')).chr(hex('5C')).chr(hex('4D')).chr(hex('69')).chr(hex('63')).chr(hex('72')).chr(hex('6F')).chr(hex('73')).chr(hex('6F')).chr(hex('66')).chr(hex('74')).chr(hex('7B')).chr(hex('43')).chr(hex('6F')).chr(hex('72')).chr(hex('65')).chr(hex('7D')).chr(hex('5C'))";

Ausgabe: C:\WINDOWS\system32\Microsoft{Core}

Trotzdem kann diese Methode die meisten M&ouml;chtegerns und Otto Normal Benutzer einfach
schon &uuml;berfordern!Der Kreativit&auml;t sind bei den Methoden keine Grenzen gesetzt.


C:\&gt; perl Metamorphismus/metamorphismus.pl

Laut Wikipedia gilt folgende Definition:

"Dieser Computervirentyp ver&auml;ndert bei einer Ausf&uuml;hrung die eigene formale Grammatik.
Im Gegensatz zu polymorphen Viren, die nur die Gestalt des Codes (durch variable
Verschl&uuml;sselung oder Permutation) &auml;ndern, wird bei dieser Technik der Virus tempor&auml;r
in eine Metasprache umgeschrieben (daher der Name), welche ver&auml;ndert wird,
und danach wieder kompiliert wird. Diese Technik ist m&ouml;glich, da die Assemblersprache
f&uuml;r einen Befehl verschiede M&ouml;glichkeiten bietet, diesen auszuf&uuml;hren.
Zum Beispiel kann der Befehl mov eax, 0x0 in xor eax, eax oder sub eax, eax umgewandelt werden.
Da eine Mutation eine Ver&auml;nderung der eigenen Grammatik bedeutet,
kann man jede neue Generation als neuen polymorphen Virus ansehen.
Daher sind metamorphe Viren viel schwerer zu erkennen als polymorphe.
Beispiele sind Win32.ZMist, Win32.MetaPHOR oder Win32.SK. Obwohl diese Viren hochkomplex sind und
vielen Antiviren Herstellern Probleme bereitet haben, sind sie vom
theoretischen Standpunkt aus gesehen noch trivial."

Wie gut dass es in Perl auch viele verschiedene L&ouml;sungen gibt um ein Ziel zu erreichen :D
Doch das ganze ist nicht leicht zu coden obwohl es gegen&uuml;ber ASM wohl wien Witz wirkt...

Also, meine Idee war folgender, dass wir zum beispiel Schleifen beliebig &auml;ndern k&ouml;nnen, wieso
haben wir wohl all diese M&ouml;glichkeiten? Das k&ouml;nnte etwa so aussehen:

Prim&auml;rer Source:

for($count = 0;$count eq 20;$count++) {
CODEBLOCK
}

Nach dem 1 Lauf:

$count = 0;
do {
$count++;
CODEBLOCK
} until($count eq 20);

Nach dem 2 Lauf:

$count = 0;
while ($count &lt;= 20) {
$count++;
CODEBLOCK
}

Und so weiter.Bei der foreach Schleife m&uuml;ssten wir beispielsweise einen Array mit 20 Zeichen f&uuml;llen und
dann diese durchgehen.Wann welche Schleife gew&auml;hlt wird, m&uuml;sste man raten lassen per random() funktion.
Das ganze erfordert aber schon ne Menge Erfahrung mit Perl um das ganze durch eine jeweils neue Schleife
ersetzen zu lassen.Dazu k&ouml;nnten wir die Variabeln auch, bei jedem Lauf neu setzen lassen.
Wie ihr seht, seht ihr nix!Ich hatte bis jetzt nur diese &Uuml;berlegung und kann euch daf&uuml;r auch keinen
Code zeigen der metamorph ist...

Auch k&ouml;nnten wir das Wichtige vom Virii in Subroutinen packen.Mit denen k&ouml;nnten wir nun folgendes machen,
zuerst einmal den Namen der Subroutine bei jedem Lauf &auml;ndern lassen, sowie die Platzierung &auml;ndern. In etwa
so:

Prim&auml;rer Source:

&amp;Code;
&amp;Code1;
&amp;Code2;

sub Code {
CODEBLOCK
}

sub Code1 {
CODEBLOCK
}

sub Code2 {
CODEBLOCK
}

Nach dem 1 Lauf:

&amp;qzwdn123;
&amp;oedue356;
&amp;lpoiw764;

sub lpoiw764 {
CODEBLOCK
}

sub oedue356 {
CODEBLOCK
}

sub qzwdn123 {
CODEBLOCK
}

Nach dem 2 Lauf:

&amp;456uerif;
&amp;039mbjuo;
&amp;007fhfds;

sub 007fhfds {
CODEBLOCK
}

sub 456uerif {
CODEBLOCK
}

sub 039mbjuo {
CODEBLOCK
}


Dabei gilt folgendes:

+-------+----------+----------+
| Prim. |  Lauf1   |   Lauf2  |
+-------+----------+----------+
|&amp;Code  |&amp;qzwdn123 |&amp;456uerif | 
|&amp;Code1 |&amp;oedue356 |&amp;039mbjuo |
|&amp;Code2 |&amp;lpoiw764 |&amp;007fhfds |
+-------+----------+----------+

Der Inhalt der Subroutinen bleibt der gleiche, doch ver&auml;ndert sich der Aufrufname sowie die
Platzierung im Source selber nach jedem Lauf.Das ganze ist also eine verschmelzung von
Polymorphismus sowie Metamoprhismus.Ich werde zusehen dass ich mal ein PoC schreibe und es 
dann ver&ouml;ffentliche.Jeder der Metamorphismus hinkriegt, dem kann ich nur Respekt zollen!
Es gibt wohl noch sehr viele weitere Arten, die man benutzen kann um seinen Code meta/poly
morph zu halten, aber dieses hier wollte ich euch schonmal so unterbreiten ;)


C:\&gt; perl Outro/Outro.pl

Das wars auch schon wieder mit meinem Paper &uuml;bers Perl Virii Coding. Ich hoffe dass ich euch
hiermit einen Anstoss gegeben habe, selber neue Techniken zu entdecken und/oder diese hier
in euren Codes zu verbauen.Vielleicht gibt es noch ein drittes Paper zum Thema, ich werd mal
schaun was die Zeit so bringt...

Ich w&uuml;nsche euch allen noch viel Spass beim coden und lesen!

Greetings to:
SkyOut
Sph1nX
Neo2k8
ringwrath-4
SCUD
JackT

Und alle anderen!


##############################
# Und dann sah ich von allen
# Sch&ouml;pfungen den Grausamsten
# und Gr&auml;sslichsten aller,
# den Herrn &uuml;ber sie alle,
# und ich wusste dass ich
# Tod war!
##############################


Written by Perforin | DarK-CodeZ.org | Welcome to the dark side of coding!

C:\&gt; exit
</pre>
</body>
</html>
