<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Da Renegade fuckin'HTML Creator">
<TITLE>stealth</TITLE>
<META NAME="Version" CONTENT="8.0.3429">
<META NAME="Date" CONTENT="11/19/96">
<META NAME="Template" CONTENT="D:\Office 97 Pro\Office\HTML.DOT">
</HEAD>
<BODY TEXT="#000000" VLINK="#800080" BGCOLOR="#000000">

<P ALIGN="CENTER"><IMG SRC="spirit.ren" WIDTH=64 HEIGHT=72><FONT FACE="Arial" SIZE=1>..........</FONT><B><FONT SIZE=6 COLOR="#ffff00">STEALTH</B></FONT><FONT FACE="Arial" SIZE=1>.........<IMG SRC="spirit.ren" WIDTH=64 HEIGHT=72></P>
<P ALIGN="CENTER">&nbsp;</P>
</FONT><FONT FACE="Arial" COLOR="#ffff00"><P>La tecnica stealth &egrave; una tecnica molto importante, specialmente per i files-virus. Viene usata per nascondersi dagli Anti - Virus.Anche qua ci sono diversi tipi, per&ograve; vedrete che l'esito sar&agrave; sempre quello di rendersi meno visibile al "nemico".</P>
<B><I><P>Un Boot sector infettato da un virus stealth :</B></I> In questo caso il virus si aggancer&agrave; all'interrupt 13h e quando, per esempio un Anti - Virus, controller&agrave; il boot sector, il virus gli far&agrave; "vedere" un boot sector falso, un boot sector "virtuale", che non c'e' realmente.In questo modo, l'Anti - Virus non se ne accorger&agrave; e il boot sector risulter&agrave; pulito.</P>
<B><I><P>L'effetto di un virus stealth sui files:</B></I>Se l'Anti -Virus cercher&agrave; di aprire il file per esaminarlo, il virus mostrer&agrave; un file pulito, come se non fosse mai stato toccato e modificato.Questo &egrave; molto importante, visto che molti Anti - Virus creano una specie di impronta di ogni file e avviseranno l'utente se un file verr&agrave; modificato.</P>
<B><I><P>Stealth Directory:</B></I>Si tratta dell'operazione simile al commando "dir".Il virus, controllando l'interrupt 21h, mostrer&agrave; a ogni programma che la grandezza del file sia pari a quella prima della infezione, cos&igrave; l'utente non se ne accorger&agrave; del cambiamento effettuato su un file.</P>
<B><I><P>L'effetto dello stealth su Windows:</B></I> Il virus, agganciandosi all'interrupt 2Fh, impedir&agrave; a Windows stesso di accorgersi che l'interrupt 13h &egrave; stato preso dal virus.</P>
<B><I><P>Lo stealth in memoria:</B></I> Una volta che il virus &egrave; attivo in memoria e viene eseguito un certo programma, per esempio un Anti - Virus, il virus stesso si "disattiva", in modo che tutti i files e la memoria sembrano puliti.Quando l'Anti - Virus sar&agrave; terminato, il virus si attiver&agrave; di nuovo e continuer&agrave; la sua infezione.</P>
<P>Poi ci sono ancora altri tipi di stealth, per&ograve; mi sembra chiaro il concetto.Come avrete notato, la tecnica stealth &egrave; pi&ugrave; o meno fondamentale, e la troverete incorporata in ogni virus abbastanza nuovo.</P>
<P>&nbsp;</P>
</FONT><P ALIGN="CENTER"><A HREF="tecni.ren#RITORNA"><B><U><FONT SIZE=5 COLOR="#00ffff">RITORNA</B></U></FONT></A> <FONT FACE="Arial" SIZE=1>........................</FONT><A HREF="indice.ren#INDICE"><B><U><FONT SIZE=5 COLOR="#00ffff">INDICE</B></U></FONT></A></P></BODY>
</HTML>
