<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<base target="detail">
<title>HPA Crack Tutorial - 5</title>
<meta name="author" content="Formater [FCF]">
<meta name="generator" content="Namo WebEditor v3.0">
</head>

<body background="bg2.gif" bgcolor="white"
 text="black" link="blue" vlink="purple" alink="red">

<h2 align="center"><font face="Comic Sans MS">Hogyan haszn&aacute;ljuk a SoftIce-t?<br>
avagy<br>
&quot;Egy debugger, amit a cracker-eknek &iacute;rtak!&quot;</font></h2>
<p><font face="Comic Sans MS">K&eacute;sz&iacute;tette: Lukundoo [HPA]<br>
e-mail: </font><a href="mailto:Lukundoo@SoftHome.Net"><font face="Comic Sans MS">Lukundoo@SoftHome.Net</font></a><font
 face="Comic Sans MS"><br>
web: </font><a href="http://welcome.to/hpa"><font face="Comic Sans MS">http://welcome.to/hpa</font></a></p>
<p><font face="Comic Sans MS"><u>Tartalomjegyz&eacute;k:</u></font><font face="Comic Sans MS"><br>
1. Mi AZ a softice?<br>
2. HoGYAN kezdj&uuml;k el?<br>
3. MiNDEN kezdet neh&eacute;z...<br>
4. De NeM biztos, hogy ez &iacute;gy m&uuml;k&ouml;dni fog!<br>
5. De eZ M&eacute;G nem minden!<br>
6. Z&aacute;RSZ&oacute; vagy amit akartok.</font></p>
<p><font face="Comic Sans MS"><u>1. Mi AZ a softice?</u></font><font face="Comic Sans MS"><br>
A Softice egy debugger program. A programnak van dos, window$, win95, win98,
winNT alatt fut&oacute; v&aacute;ltozata is. &Eacute;n most csak &nbsp;a Win95
/98 alatt fut&oacute; v&aacute;ltozattal&nbsp;foglalkozom. A program m&eacute;g
a WIN.COM bet&ouml;lt&otilde;d&eacute;se el&otilde;tt elindul, &iacute;gy m&aacute;r
a rendszer bet&ouml;lt&eacute;s&eacute;be is bele tudunk avatkozni. A programot
fel kell install&aacute;lni, &eacute;s ut&aacute;na m&aacute;r indulhat is a
m&oacute;ka.</font></p>
<p><font face="Comic Sans MS"><u>2. HoGYAN kezdj&uuml;k el?</u></font><font face="Comic Sans MS"><br>
Miut&aacute;n felinstall&aacute;ltuk, be kell &aacute;ll&iacute;tani a videok&aacute;rty&aacute;nk
t&iacute;pus&aacute;t. Ez nem mindig t&ouml;k&eacute;letes, f&otilde;leg a 3.1
el&otilde;tti&nbsp;verzi&oacute;kn&aacute;l. Teh&aacute;t &eacute;rdemes let&ouml;lteni
az&nbsp;ujjabb verzi&oacute;t. Ha&nbsp;azzal se m&ucirc;k&ouml;dik, akkor marad
az utols&oacute; lehet&otilde;s&eacute;g, a felbont&aacute;st le kell venni
640x480x16 sz&iacute;nre. Ezzel a felbont&aacute;ssal&nbsp;mindig&nbsp;elindul,
de nem &nbsp;&eacute;lvezhet&otilde; pl. egy&nbsp;grafikai program felt&ouml;r&eacute;se.
Ezut&aacute;n meg is kezdhetj&uuml;k a m&oacute;k&aacute;t.</font></p>
<p><font face="Comic Sans MS"><u>3. MiNDEN kezdet neh&eacute;z...</u></font><font
 face="Comic Sans MS"><br>
Egy sima felt&ouml;r&eacute;sn&eacute;l, meg kell&nbsp;n&eacute;zni, hogy hol
van az a&nbsp;pont, ahol sz&eacute;riasz&aacute;mot k&eacute;r a program. Ha
megvan, akkor be kell &iacute;rni b&aacute;rmilyen nevet, adatot, &eacute;s
sz&eacute;riasz&aacute;mot. Miel&otilde;tt r&aacute;kttintan&aacute;nk az &quot;OK&quot;
gombra, CTRL+D-t kell nyomnunk, &eacute;s tadam, bej&ouml;n a SoftIce sz&ouml;veges
ablaka. Itt lehet majd &nbsp;l&aacute;tni &nbsp;az aktu&aacute;lis regiszter&nbsp;&aacute;ll&aacute;st,
keresni lehet a mem&oacute;ri&aacute;ban, r&aacute; &nbsp;lehet &nbsp;&aacute;ll&iacute;tani
&nbsp;u. n. &quot;breakpoint&quot;-ot, megszak&iacute;t&aacute;si kiugr&aacute;si
pontot, k&uuml;l&ouml;nb&ouml;z&otilde; esem&eacute;nyekre. Ezek az esem&eacute;nyek
a win95/98 esem&eacute;nyei, pl. ablak megnyit&aacute;sa, sz&ouml;veg beolvas&aacute;sa
egy&nbsp;dialogusb&oacute;l, &eacute;s &iacute;gy&nbsp;tov&aacute;bb. Mivel
&nbsp;mi&nbsp;a regisztr&aacute;l&aacute;st szeretn&eacute;nk ki&uuml;tni, ez&eacute;rt
csak p&aacute;r&nbsp;esem&eacute;nyt&nbsp;kell&nbsp;ismern&uuml;nk.&nbsp;Ezek
n&eacute;vszerint a k&ouml;vetkez&otilde;k:</font></p>
<p><font face="Courier" size="2">GetWindowText &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az
ablakb&oacute;l olvas&aacute;s 16 bites progikn&aacute;l<br>
GetWindowTextA &nbsp;&nbsp;&nbsp;&nbsp;ugyanaz mint az el&otilde;z&otilde;,
csak 32 bites progikn&aacute;l<br>
GetDlgItemIext &nbsp;&nbsp;&nbsp;&nbsp;Dial&oacute;gusablakb&oacute;l val&oacute;
olvas&aacute;s 16 bitesn&eacute;l<br>
GetDlgItemIextA &nbsp;&nbsp;&nbsp;ugyanaz mint az el&otilde;z&otilde;k, csak
32 bitn&eacute;l<br>
HmemCpy &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mem&oacute;ria
ter&uuml;let m&aacute;sol&aacute;sa (ez az egyik legjobb!)</font></p>
<p><font face="Comic Sans MS">A v&eacute;g&eacute;n lev&otilde; &nbsp;&quot;A&quot;
bet&ucirc; mindig azt jelenti, hogy 32 bites progikn&aacute;l lehet haszn&aacute;lni,
ha nincs, akkor pedig a 16 bites programokn&aacute;l lehet csak haszn&aacute;lni...
Nem neh&eacute;z! &Eacute;rdemes haszn&aacute;lni a &nbsp;hmemcpy parancsot,
mert &nbsp;99%-ban &nbsp;m&ucirc;k&ouml;dik. De m&eacute;g nem tudjuk, hogy&nbsp;hogyan
lehet r&aacute;&aacute;ll&iacute;tani erre az esem&eacute;nyre a breakpoint-ot?
Ezt a:</font></p>
<p><font face="Courier" size="2">BPX &lt;esem&eacute;ny neve&gt;</font></p>
<p><font face="Comic Sans MS">parancssal lehet megtenni. Teh&aacute;t &uuml;ss&uuml;k
be hogy BPX hmemcpy, &eacute;s &nbsp;ut&aacute;na nyomjuk meg az&nbsp;F5 gombot.
Visszat&eacute;rt&uuml;nk az eredeti programhoz. Most m&aacute;r r&aacute;nyomhatunk
az &quot;OK&quot; gombra, &eacute;s a program megkezdi a sz&eacute;riasz&aacute;m
ellen&otilde;rz&eacute;st. Ekkor r&ouml;gt&ouml;n megjelenik a&nbsp;SoftIce
sz&ouml;veges &uuml;zemm&oacute;d&uacute; ablaka, &eacute;s ott vagyunk a hmemcpy
parancs hely&eacute;n. Az alj&aacute;n az ablaknak megjelenik, hogy milyen program
k&oacute;dj&aacute;ban&nbsp;turk&aacute;lunk. Mostm&aacute;r tudjuk, hogy milyen
programban vagyunk. De nek&uuml;nk nem ez a program kell, ez&eacute;rt vissza
kell l&eacute;pkedn&uuml;nk az F12 gombbal, addig a pontig, am&iacute;g nem
annak a programnak&nbsp;a nev&eacute;t l&aacute;tjuk, amit&nbsp;fel&nbsp;szeretn&eacute;nk
t&ouml;rni.&nbsp;Ezt a folyamatot (F12 nyomogat&aacute;s&aacute;t) am&iacute;g
nem &eacute;r&uuml;nk el&nbsp;egy call utas&iacute;t&aacute;sig. Ezut&aacute;m
m&aacute;r l&eacute;pkedhet&uuml;nk a &nbsp;k&oacute;dban az&nbsp;F10&nbsp;gombbal
eg&eacute;szen&nbsp;addig a&nbsp;pontig, ahol valamilyen eld&ouml;ntend&otilde;
ugr&aacute;s van (pl. JNE, JE, JLE,TEST). &Eacute;n mindig leszoktam tenni az
ilyen helyekre egy &uacute;gynevezett megszak&iacute;t&aacute;si pontot. Ezt
a eg&eacute;rrel r&aacute;kattintva &nbsp;az &nbsp;adott sorra lehet megtenni.
Majd folytatjuk &nbsp;az &nbsp;F10-es &nbsp;barangol&aacute;st. Ha&nbsp;a&nbsp;j&oacute;
ugr&aacute;st tal&aacute;ltuk meg, akkor meg fog jelenni egy &uuml;zenetablak,
hogy a program nem lett regisztr&aacute;lva, &eacute;s hogy&nbsp;rossz a regisztr&aacute;ci&oacute;s
k&oacute;d. Most m&aacute;r nincs sok dolgunk, mert ki kell list&aacute;znunk,
hogy milyen megszak&iacute;t&aacute;si pontjaink vannak, ezt a BL parancssal
lehet megtenni, majd kit&ouml;r&ouml;lj&uuml;k a hmemcpy megszak&iacute;t&aacute;si
pontot a BC &lt;sz&aacute;m&gt;-al, ahol a sz&aacute;m a hmemcpy el&otilde;tt
&aacute;ll&oacute; sz&aacute;m. Mostm&aacute;r k&ouml;zel &aacute;llunk a megold&aacute;shoz.
Meg kell nyomni az F5 gombot, &eacute;s folytatja a program a dolg&aacute;t.
Most &uacute;jra hozzuk&nbsp;be a regisztr&aacute;ci&oacute;s ablakot, &eacute;s
mostm&aacute;r azokat az adatokat &iacute;rjuk be, amire szeretn&eacute;nk a
programot regisztr&aacute;lni, &eacute;s ut&aacute;na nyomjunk meg az &quot;OK&quot;
gombot. Most ha mindent j&oacute;l csin&aacute;ltunk, akkor ott&nbsp;fog meg&aacute;llni
a program, ahol&nbsp;a&nbsp;program eld&ouml;nti, hogy j&oacute;, vagy rossz
a k&oacute;dunk. Mostm&aacute;r nincs m&aacute;s h&aacute;tra, csak az adott
opk&oacute;dot kell kicser&eacute;lni m&aacute;sra. Ez &aacute;ltal&aacute;ban
abb&oacute;l &aacute;ll hogy a megfelel&otilde; utas&iacute;t&aacute;st kicser&eacute;lj&uuml;k
az ellenkez&otilde;j&eacute;re. Pl.:</font></p>
<p><font face="Courier" size="2">JE &nbsp;&lt;--&gt; JNE<br>
JMP &lt;--&gt; NOP<br>
JZ &nbsp;&lt;--&gt; JNZ</font></p>
<p><font face="Comic Sans MS">De ezt hogyan kell? A k&oacute;d kicser&eacute;l&eacute;se
az &quot;A&quot; bet&uuml;t le&uuml;tve, &eacute;s ut&aacute;na bej&ouml;n az
offszetc&iacute;m, &eacute;s oda kell be&iacute;rni. Pl.:</font></p>
<p><font face="Courier" size="2">0028:15445323 7506 JNZ 15445368 </font></p>
<p><font face="Comic Sans MS">ez az eredeti k&oacute;dm&oacute;dos&iacute;t&aacute;s
el&otilde;tt </font><font face="Courier" size="2">0028:15445323</font><font face="Comic Sans MS">
&eacute;s ut&aacute;na</font></p>
<p><font face="Courier" size="2">0028:15445323 7406 JZ 15445368</font></p>
<p><font face="Comic Sans MS">ez a m&oacute;dos&iacute;tott k&oacute;d</font></p>
<p><font face="Comic Sans MS">Mostm&aacute;r a &nbsp;megfele&otilde; helyre
fog&nbsp;ugrani&nbsp;a programunk, miut&aacute;n az F10 billeny&ucirc;t megnyomjuk.
&Eacute;s m&aacute;ris arra a&nbsp;r&eacute;szre ugrottunk, ahol a program &nbsp;elfogadja
&nbsp;a &nbsp;regisztr&aacute;ci&oacute;s sz&aacute;munkat. Enn&eacute;l egyszer&ucirc;bb
megold&aacute;s ha r&aacute;kattintunk az EIP ut&aacute;n l&eacute;v&otilde;
sz&aacute;mra, &eacute;s &aacute;t&iacute;rjuk arra, ami a JNZ utas&iacute;t&aacute;s
&nbsp;ut&aacute;n &aacute;ll. Ezut&aacute;n &nbsp;m&aacute;r a program azt &iacute;rja
ki, hogy gratul&aacute;lunk, &Ouml;n regisztr&aacute;lt felhaszn&aacute;l&oacute;ja&nbsp;a
programnak.... :)</font></p>
<p>&nbsp;<font face="Comic Sans MS"><u>4. De NeM biztos, hogy ez &iacute;gy
m&uuml;k&ouml;dni fog!</u></font><font face="Comic Sans MS"><br>
Sajnos a legt&ouml;bb program nem csak egy helyen ellen&otilde;rzi a k&oacute;dot,
hanem t&ouml;bb ponton is! Ezen a &nbsp;ponton k&eacute;t &nbsp;lehet&otilde;s&eacute;g
ad&oacute;dik, amit ki lehet pr&oacute;b&aacute;lni:</font></p>
<p><font face="Comic Sans MS">a.) Meg kell n&eacute;zni azt a call utas&iacute;t&aacute;st,ami
ut&aacute;n az ugr&aacute;s k&ouml;vetkezett, &eacute;s a call utas&iacute;t&aacute;son
bel&uuml;l kell megkeresni azt&nbsp;a pontot, ahol a t&eacute;nylegesen &nbsp;ellen&otilde;rzi&nbsp;a&nbsp;be&iacute;rt
k&oacute;dot. Ha ezt&nbsp;megtal&aacute;ljuk, akkor ugyan&uacute;gy mint az
el&otilde;bb, ki&nbsp;kell&nbsp;cser&eacute;lni&nbsp;az&nbsp;ugr&aacute;st,&nbsp;&eacute;s
ezut&aacute;n a program mindenhol,&nbsp;ahol&nbsp;ellen&otilde;rzi a k&oacute;dot,
&nbsp;helyesen fog ugrani.</font></p>
<p><font face="Comic Sans MS">b.) A &nbsp;m&aacute;sik &nbsp;megold&aacute;s
az, hogy a call &nbsp;utas&iacute;t&aacute;sba&nbsp;belemegy&uuml;nk az F8 billenty&uuml;
lenyom&aacute;s&aacute;val , &eacute;s r&ouml;gt&ouml;n az els&otilde; utas&iacute;t&aacute;sra
r&aacute;&nbsp;kell kattintani, &eacute;s kijel&ouml;lj&uuml;k megszak&iacute;t&aacute;si
pontnak. Ezut&aacute;n m&aacute;r csak v&eacute;gig kell pr&oacute;b&aacute;lgatni
az &ouml;sszes &nbsp;funkci&oacute;t (Open, Save, Print, etc...), &eacute;s
ahol el&otilde;j&ouml;n a SoftIce ablaka, ott tov&aacute;bb kell l&eacute;pkedni,
&eacute;s meg fogjuk tal&aacute;lni ugyan&uacute;gy mint az el&otilde;bb, a
call utas&iacute;t&aacute;sb&oacute;l kil&eacute;pve, azt a JNZ utas&iacute;t&aacute;st,
ami a regisztr&aacute;latlan r&eacute;szre ugrik. Ugyan&uacute;gy mint el&otilde;bb
itt is ki kell cser&eacute;lni&nbsp;a JNZ utas&iacute;t&aacute;st JZ-re. Ezt
mindenhol, ahol el&otilde;j&ouml;n, ki kell&nbsp;cser&eacute;lni. Ezut&aacute;n
m&aacute;r a program biztosan fel lesz t&ouml;rve.</font></p>
<p><font face="Comic Sans MS"><u>5. De eZ M&eacute;G nem minden!</u></font><font
 face="Comic Sans MS"><br>
Miut&aacute;n kil&eacute;pt&uuml;nk a&nbsp;programb&oacute;l, &eacute;s &uacute;jra
elind&iacute;tottuk, m&aacute;r megint regisztr&aacute;latlank&eacute;nk fog&nbsp;indulni.
H&aacute;t akkor &nbsp;nem volt semmi &eacute;rtelme annak, hogy felt&ouml;rt&uuml;k
a programot? Dehogy... Mindig fel&nbsp;kell &iacute;rni a hexadecim&aacute;lis
k&oacute;dj&aacute;t az utas&iacute;t&aacute;snak, miel&ouml;tt, &eacute;s miut&aacute;n
m&oacute;dos&iacute;tottuk. p&eacute;ld&aacute;ul az el&ouml;bb p&eacute;ld&aacute;b&oacute;l
kiindulva:</font></p>
<p><font face="Courier" size="2">0028:15445323 7506 JNZ 15445368 ez az eredeti
k&oacute;d<br>
0028:15445323 7406 JZ &nbsp;15445368 ez a m&oacute;dos&iacute;tott k&oacute;d</font></p>
<p><font face="Comic Sans MS">Miel&otilde;tt m&oacute;dos&iacute;tottuk, a hexa
k&oacute;dja 7506 volt, miut&aacute;n &nbsp;m&oacute;dos&iacute;tottuk, a hexa
k&oacute;dja 7406 lett. De ezt hogy kell el&otilde;hozni a SoftIce-b&oacute;l,
hogy mutassa az utas&iacute;t&aacute;s hexadecim&aacute;lis k&oacute;dj&aacute;t?
Be kell&nbsp;g&eacute;pelni a SoftIce ablakba, hogy CODE ON. Ezut&aacute;n m&aacute;r
ott lesz. De ez a hexa k&oacute;d m&eacute;g kev&eacute;s lesz, mert ha erre
r&aacute;keres&uuml;nk a file-ban, akkor kb. 200 ilyet tal&aacute;lunk. Teh&aacute;t
&eacute;rdemes az el&otilde;tte, &eacute;s az ut&aacute;na k&ouml;vetkez&otilde;
utas&iacute;t&aacute;s hexa k&oacute;dj&aacute;t is fel&iacute;rni. Ezut&aacute;n
m&aacute;r csak az a dolgunk, hogy k&eacute;sz&iacute;t&uuml;nk egy m&aacute;solatot
az eredeti file-r&oacute;l, &eacute;s egy&nbsp;hexa editorba,&nbsp;p&eacute;ld&aacute;ul
a HexWorkShop-ba, be kell h&iacute;vni&nbsp;az eredeti file-t, r&aacute; kell
keresni arra a hexa &nbsp;sztringre, amit fel&iacute;rtunk, &eacute;s kicser&eacute;lni
arra ami m&aacute;r m&oacute;dos&iacute;tva lett. Ezut&aacute;n m&aacute;r a
program v&eacute;glegesen is fel lett t&ouml;rve!!!!</font></p>
<p>&nbsp;<font face="Comic Sans MS"><u>6. Z&aacute;RSZ&oacute; vagy amit akartok.</u></font><font
 face="Comic Sans MS"><br>
Rem&eacute;lem minden &eacute;rthet&otilde; volt a mai &quot;tananyagban&quot;,
&eacute;s mindenkit&nbsp;arra &ouml;szt&ouml;n&ouml;z, hogy programokat t&ouml;rj&ouml;n
fel. Ha valaki el&eacute;g k&eacute;sztet&eacute;st &eacute;rez arra, hogy programokat
t&ouml;rj&ouml;n fel, az&nbsp;vegye fel a kapcsolatot velem, &eacute;s felvessz&uuml;k
&quot;trial member&quot;-nek&nbsp;a HPA csapat&aacute;ba.</font></p>
<p align="right"><font face="Comic Sans MS">Lukundoo [HPA]<br>
1999. jan. 21.</font></p>
<p align="center"><font face="Comic Sans MS" color="black"><img src="../../../PROGRA~1/NAMO/WEBEDI~1/WORK/ISSUE1~1/hr.gif"
 width="457" height="15" border="0"></font></p>
</body>

</html>