<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<title>Rad Imre honlapja [PWL]</title>
<meta name="generator" content="Namo WebEditor v3.0">
</head>

<body bgcolor="white" text="black" link="blue" vlink="purple" alink="red">

<p align="center"><b>PWL HACKING TUTORIAL v2.0</b></p>
<p>PWL=PassWord List. A Windows alap&uacute; rendszerek ilyen kiterjeszt&eacute;s&ucirc; 
f&aacute;jlokban t&aacute;rolj&aacute;k a jelszavakat, a g&eacute;pen lev&otilde; 
felhaszn&aacute;l&oacute;k fel&uuml;let&eacute;hez. &Eacute;s ez m&eacute;g 
nem minden, ezekben a f&aacute;jlokban el van t&aacute;rolva mindaz, amivel 
a kapcsolatba ker&uuml;lt&eacute;l jelsz&oacute; szinten, pl ha egy internetes 
laphoz k&oacute;d kell (szabv&aacute;ny k&oacute;dbek&eacute;r&otilde;) akkor 
ez is ezekben a f&aacute;jlokban t&aacute;rol&oacute;dik. <br>
A Win 95 OSR2 &eacute;s a WIN98 PWL form&aacute;tuma megegyezik, a Win NT m&aacute;s 
biztons&aacute;gi modellt haszn&aacute;l, az alap W95-&eacute; pedig el&eacute;g 
szeg&eacute;nyes...&nbsp;:-) </p>
<p>Teh&aacute;t a PWL-ben az alap felhaszn&aacute;l&oacute; fel&uuml;lethez 
tartoz&oacute; jelsz&oacute; MELLETT tov&aacute;bbi jelszavak is lehetnek, melynek 
t&iacute;pusai: </p>
<p><i>Res. Type: Link</i> <br>
Ez az eml&iacute;tett internetes oldalra a jelsz&oacute; </p>
<p><i>Res. Type: Mail</i> <br>
Helyi h&aacute;l&oacute;n a levelez&otilde;szerverhez a hozz&aacute;f&eacute;r&eacute;s 
</p>
<p><i>Res. Type: Dial</i> <br>
H&aacute;t igen, ez a leghaszn&aacute;lhat&oacute;bb, m&eacute;gpedig a Dial-Up 
(Telefonos h&aacute;l&oacute;zat) jelszava </p>
<p>Biztosan van m&eacute;g, ezekkel tal&aacute;lkoztam. </p>
<p>A tov&aacute;bbiakban a W95OSR2/W98 pwl &aacute;llom&aacute;nyait tekints&eacute;tek 
defaultnak, arr&oacute;l besz&eacute;lek. :) Ha a pwl f&aacute;jl csak a felhaszn&aacute;l&oacute;i 
fel&uuml;letet &otilde;rzi, nincs benne elt&aacute;rolva semmi pluszinform&aacute;ci&oacute;, 
akkor a m&eacute;rete 688 b&aacute;jt. Ha internetes jelsz&oacute; szerz&eacute;s&eacute;re 
adtad a fejed, akkor az ilyen f&aacute;jlokkal f&ouml;l&ouml;sleges foglalkoznod. 
Ha enn&eacute;l nagyobb a m&eacute;ret, akkor biztos lehetsz benne, hogy van 
valamilyen aj&aacute;nd&eacute;k a f&aacute;jlban... :) </p>
<p>Ezek a jelszavak term&eacute;szetesen k&oacute;dolt form&aacute;ban tal&aacute;lhat&oacute;k 
meg a f&aacute;jlban. Teh&aacute;t egy szimpla F3-mal nem tudod megn&eacute;zni 
ezeket az inform&aacute;ci&oacute;kat. Ha plusz inform&aacute;ci&oacute;kat 
(ezt nevezik cached passwords-nek) szeretn&eacute;d megtudni, akkor is sz&uuml;ks&eacute;ged 
van a pwl-hez tartoz&oacute; jelsz&oacute;ra, hiszen az ebb&otilde;l &aacute;ll&oacute;/keletkez&otilde; 
kulccsal van k&oacute;dolva az is. Ami m&eacute;g a PWL mellett sz&oacute;l, 
hogy a nyit&oacute;jelsz&oacute;ja (teh&aacute;t nem a cached passwords) nem 
case sensitive, azaz nincs benne kis/nagybet&ucirc; megk&uuml;l&ouml;nb&ouml;ztet&eacute;s. 
Ennek akkor van nagy jelent&otilde;s&eacute;ge, ha neki&aacute;llsz Brute Force-szal 
t&ouml;rni, de err&otilde;l majd lejjebb. </p>
<p>Kaptam egy kedves levelet, amiben a PWL t&ouml;r&eacute;sn&eacute;l jobb 
m&oacute;dszert mutattak... hehe... csak egy k&eacute;t apr&oacute;s&aacute;g 
van benne buktat&oacute;ul. Teh&aacute;t mint eml&iacute;tettem a plusz inform&aacute;ci&oacute; 
a l&eacute;nyeg. Ennek a megtud&aacute;s&aacute;hoz IS a pwl jelszav&aacute;ra 
van sz&uuml;ks&eacute;g. L&eacute;tezik olyan program (pl.: pwlcrack) ami megmutatja 
a cached password-&ouml;ket viszont az AKTU&Aacute;LIS felhaszn&aacute;l&oacute;&eacute;t. 
Ha egyszer m&aacute;r bel&eacute;pett az ember, akkor a jelszava m&aacute;r 
nyilv&aacute;n adott, &eacute;s &iacute;gy tud hozz&aacute;f&eacute;rni a program 
ezekhez. Teh&aacute;t ha egy hazahozott PWL-lel van dolgod, akkor ez a m&oacute;dszer 
nem j&ouml;het sz&aacute;m&iacute;t&aacute;sba. Ha viszont nem figyel oda az 
ismer&otilde;s&ouml;d, vagy internetes k&aacute;v&eacute;h&aacute;z, vagy ilyen 
helyre t&eacute;vedsz, akkor val&oacute;ban sok haszn&aacute;t lehet venni. 
Term&eacute;szetesen, azt mondanom sem kell, hogy NE lemezen vidd magaddal, 
(engem is kitiltottak a k&ouml;nyvt&aacute;rb&oacute;l miatta... :( ), hanem 
k&uuml;ldd el egy ingyenes mail c&iacute;mre, amihez ott is hozz&aacute;f&eacute;rhetsz. 
&Otilde;szint&eacute;n sz&oacute;lva viszont, amelyik ingyenes hely ilyen laz&aacute;n 
veszi a dolgot, hogy a saj&aacute;t felhaszn&aacute;l&oacute; fel&uuml;leten 
hozz&aacute;f&eacute;r&eacute;st enged a jelszavakhoz, az mag&aacute;ra vessen... 
:) Viszont l&aacute;ttam olyan megold&aacute;st, hogy az internetes jelsz&oacute;hoz 
csak a rendszergazda f&eacute;rt hozz&aacute;, &eacute;s a t&ouml;bbi felhaszn&aacute;l&oacute; 
a szerveren kereszt&uuml;l csatlakozott az internetre. Ebben az esetben sem 
&eacute;r semmit ez a pwlcrack. (Ja, a DialPwd egyes v&iacute;rus&iacute;rt&oacute;k 
szerint tr&oacute;jaival fert&otilde;z&ouml;tt! Semmik&eacute;ppen sem javaslom.) 
Mi volt a megold&aacute;s? Haza kellett vinni az &ouml;sszes PWL-t, &eacute;s 
neki&aacute;llni a felt&ouml;r&eacute;snek. </p>
<p><b>Hogyan t&ouml;rj&uuml;k?</b> <br>
A PWL f&aacute;jlokn&aacute;l egy alapvet&otilde;inform&aacute;ci&oacute;ra 
van sz&uuml;ks&eacute;g a t&ouml;r&eacute;shez, k&uuml;l&ouml;nben f&ouml;l&ouml;sleges 
vele szenvedni. Az egyik a felhaszn&aacute;l&oacute;n&eacute;v. Ezt a Windows 
is ki&iacute;rja a vez&eacute;rl&otilde;pult/felhaszn&aacute;l&oacute;k men&uuml;ben, 
illetve a f&aacute;jl nev&eacute;b&otilde;l is lehet r&aacute; k&ouml;vetkeztetni. 
(Vagy pwlhack-kel a /grab opci&oacute;) A Windows a system.ini-ben tartja, hogy 
melyik pwl-hez milyen felhaszn&aacute;l&oacute;n&eacute;v tartozik. Ha van egy 
petra.pwl nev&ucirc; f&aacute;jlod, akkor a felhaszn&aacute;l&oacute;n&eacute;v 
tuti hogy Petra. Kis nagy bet&ucirc; nem sz&aacute;m&iacute;t. (&Eacute;kezetben 
viszont lehet, ezt nem tudom.) A Windows az alapj&aacute;n adja a f&aacute;jlnevet, 
hogy mi a felhaszn&aacute;l&oacute;n&eacute;v. Csak 8 karaktert haszn&aacute;l, 
teh&aacute;t a rendszer.pwl felhaszn&aacute;l&oacute;neve lehet rendszer, de 
lehet ak&aacute;r rendszergazda is. Az &eacute;kezeteket nem hasz&aacute;l a 
Windows. Ha k&eacute;t ugyanolyan f&aacute;jl keletkezne, akkor az &uacute;jabbnak 
egy sz&aacute;mot rak a v&eacute;g&eacute;re. Ez&eacute;rt szerencs&eacute;s 
ink&aacute;bb a megn&eacute;zni a system.ini-ben... </p>
<p>Megvan a felhaszn&aacute;l&oacute;n&eacute;v, most m&aacute;r csak a jelsz&oacute;ra 
van sz&uuml;ks&eacute;g. K&eacute;t m&oacute;dszert szeretn&eacute;k bemutatni, 
alapvet&otilde; t&ouml;r&eacute;si elj&aacute;r&aacute;sok :) </p>
<p><i>Dictionary Attack:</i> <br>
Ez azt jelenti, hogy egy sz&oacute;t&aacute;r&aacute;llom&aacute;nyb&oacute;l 
a t&ouml;r&otilde; program v&eacute;gigpr&oacute;b&aacute;lja az &ouml;sszes 
szerepl&otilde; sz&oacute;t. Ez akkor hasznos, ha a h&uuml;lye felhaszn&aacute;l&oacute; 
valami gyakori k&oacute;dot adott meg. (pl: titanic) El&otilde;nye a m&oacute;dszernek 
hogy gyors, &eacute;s (tapasztalat) gyakran sikeres. :) Sz&uuml;ks&eacute;g 
van a sz&oacute;t&aacute;r&aacute;llom&aacute;nyra, jobb programok mell&eacute; 
adj&aacute;k, &eacute;s term&eacute;szetesen saj&aacute;tot is lehet haszn&aacute;lni. 
Az k&uuml;l&ouml;n extr&aacute;nak sz&aacute;m&iacute;t, ha n&eacute;h&aacute;ny 
vari&aacute;ci&oacute;t is kipr&oacute;b&aacute;l a program soronk&eacute;nt, 
p&eacute;ld&aacute;ul mell&eacute;rak egy sz&aacute;mot (kutyus01, kutyus02, 
stb.) vagy megpr&oacute;b&aacute;lja a ford&iacute;tottj&aacute;t. (dog-&gt;god) 
</p>
<p><i>Brute Force:</i> <br>
Nyers er&otilde;. Hogy mi&eacute;rt ilyen h&uuml;lye nevet adtak neki, az szerintem 
&ouml;r&ouml;kk&eacute; rejt&eacute;ly marad. Tal&aacute;n az&eacute;rt, mert 
az ilyen m&oacute;dszerhez el&eacute;g er&otilde;s processzor&uacute; g&eacute;pre 
van sz&uuml;ks&eacute;g, hogy elviselhet&otilde; legyen a sebess&eacute;g. M&eacute;g 
mindig nem mondtam hogy mi ez... teh&aacute;t ezzel a m&oacute;dszerrel a k&oacute;dt&ouml;r&otilde; 
az &ouml;sszes l&eacute;tez&otilde; vari&aacute;ci&oacute;t pr&oacute;b&aacute;lja 
v&eacute;gig. Ez term&eacute;szetesen a jelsz&oacute; hossz&uacute;s&aacute;g&aacute;val 
ar&aacute;nyosan n&otilde; (hatv&aacute;nyosan...). A v&aacute;laszthat&oacute; 
karakterek sz&aacute;ma hat&aacute;rozza meg a lehet&otilde;s&eacute;gek sz&aacute;m&aacute;t 
(kombinatorika). Pl. egy angol sz&oacute; a jelsz&oacute;, nincs benne &eacute;kezet, 
nincs benne sz&aacute;m, nincs benne m&aacute;s karakter, akkor a haszn&aacute;lhat&oacute; 
angol &aacute;b&eacute;c&eacute; 26 karaktere j&ouml;het sz&aacute;m&iacute;t&aacute;sba, 
&eacute;s &iacute;gy mondjuk egy &ouml;t karakteres jelsz&oacute; eset&eacute;n 
a lehet&otilde;s&eacute;gek sz&aacute;ma 26*26*26*26*26, azaz 26^5. Ez 11881376. 
&Eacute;rthet&otilde; &iacute;gy m&aacute;r, hogy mi&eacute;rt tart ez hosszabb 
ideig? :) El&otilde;nye viszont k&eacute;ts&eacute;gk&iacute;v&uuml;l az alaposs&aacute;g 
&eacute;s hogy nem marad ki semmi, meg hogy tuti meglesz az amit keresel... 
:) <br>
A sebess&eacute;gr&otilde;l nem szeretn&eacute;k mondani, mert f&uuml;gg a processzort&oacute;l, 
f&uuml;gg a karakterek sz&aacute;m&aacute;t&oacute;l... </p>
<p>Most m&aacute;r csak egy dolgot nem mondtam el, hogy milyen szoftverekkel 
&aacute;llhatunk neki dolgozni... </p>
<p><i>GLIDE:</i> <br>
Amit semmik&eacute;ppen nem aj&aacute;nlok, az a Glide. Egyszer&ucirc;en sehogyan 
sem siker&uuml;lt a programot m&ucirc;k&ouml;d&eacute;sre b&iacute;rni. Felhaszn&aacute;l&oacute;nevet 
alap&eacute;rtelmez&eacute;sk&eacute;nt a f&aacute;jln&eacute;vnek tekinti, 
&eacute;s folyton k&eacute;rdez. Csak Brute Force-ot t&aacute;mogat. Cached 
Passwords-ot nem tudja, &eacute;s &uacute;gy n&eacute;z ki, hogy csak az alap 
W95 f&aacute;jljaihoz j&oacute;. Egyetlen el&otilde;nye tal&aacute;n az, hogy 
egy C++-ben &iacute;rt forr&aacute;st adnak mell&eacute;. Term&eacute;szetesen 
sz@rra nem lehet &eacute;p&iacute;tkezni... :) </p>
<p><i>PWLCRACK</i> <br>
Egyes hackeroldalon hangoztatott &aacute;ll&iacute;t&aacute;sokkal szemben a 
PWLCRACK egy Win32 alkalmaz&aacute;s, nem indul el DOS alatt. Az m&aacute;s 
k&eacute;rd&eacute;s, hogy karakteres k&eacute;perny&otilde;t haszn&aacute;l, 
nem ablakozik. De persze ennek k&ouml;ze sincs az OS-hez, de ezt hagyjuk. <br>
A program csak a cached password-&ouml;ket &iacute;rja ki. Szabv&aacute;ny API 
h&iacute;v&aacute;ssal m&ucirc;k&ouml;dik. </p>
<p><i>DIAL-UP</i> <br>
Az el&otilde;z&otilde;h&ouml;z hasonl&oacute; program, szint&eacute;n csak a 
cached passwordsh&ouml;z j&oacute;. K&uuml;l&ouml;n el&otilde;nye, hogy ki&iacute;r 
a Windows registryb&otilde;l is minden haszn&aacute;lhat&oacute; inform&aacute;ci&oacute;t 
az internetes be&aacute;ll&iacute;t&aacute;sokra vonatkoz&oacute;lag. Teh&aacute;t 
DNS szerverek, IP c&iacute;m, login script, stb. </p>
<p><i>PWL HACK:</i> <br>
Ez egy j&oacute; kicsi, orosz program. El&otilde;nye az el&otilde;z&otilde;vel 
szemben, hogy m&ucirc;k&ouml;dik. :) T&aacute;mogatja a Brute Force, &eacute;s 
a Dictionary m&oacute;dokat is, &eacute;s a megszak&iacute;tott keres&eacute;st 
is folytatni tudja. Van mell&eacute; egy kis forr&aacute;s is C, term&eacute;szetesen. 
A megfejtett k&uuml;ls&otilde; PWL-b&otilde;l is, s&otilde;t az aktu&aacute;lis 
felhaszn&aacute;l&oacute; cached passwords-&eacute;t is kijelzi, teh&aacute;t 
a PWLCRACK progi lehet&otilde;s&eacute;geit is mag&aacute;ban foglalja. <br>
Van m&eacute;g neki az eml&iacute;tett grab funkci&oacute;ja, ami kimenti a 
felhaszn&aacute;l&oacute;neveket. A spy funkci&oacute; l&aacute;tja el a PWLCRACk 
dolg&aacute;t. Nagyon gyorsan dolgozik a BruteForce-szal, l&eacute;nyegesen 
gyorsabban mint a Wines t&aacute;rsai. <br>
Az progi dpmi alkalmaz&aacute;s, fut DOS-b&oacute;l &eacute;s Winb&otilde;l 
is. Nem grafikus a fel&uuml;lete, param&eacute;terezgetni kell.&nbsp; Az el&otilde;z&otilde; 
progik kicsik, ennek a m&eacute;rete viszont 400k k&ouml;r&uuml;l mozog. A SAC-on 
is megtal&aacute;lhat&oacute;&nbsp;:) </p>
<p><i>CAIN &amp; ABEL:</i> <br>
1. K&eacute;perny&otilde;v&eacute;d&otilde; jelszava, r&ouml;gt&ouml;n &eacute;s 
kap&aacute;sb&oacute;l. <br>
2. K&uuml;ls&otilde; regisztryb&otilde;l ugyanez. <br>
3. A sz&aacute;m&iacute;t&oacute;g&eacute;pen lev&otilde; f&aacute;jlmegoszt&aacute;st, 
nyomtat&oacute;megoszt&aacute;st stb. jelszavait is kap&aacute;sb&oacute;l megmutatja. 
<br>
4. Pwlcrack is, teh&aacute;t aktu&aacute;lis felhaszn&aacute;l&oacute; cached 
passwordjei. <br>
5. Egy PWL t&ouml;r&otilde;, Dictionary, &eacute;s Brute Force elven is, &eacute;s 
eg&eacute;sz j&oacute; WordListet adnak hozz&aacute;!! <br>
6. Helyi h&aacute;l&oacute;n lev&otilde; shared jelszavak kijelz&eacute;se (Sajnos 
csak egy g&eacute;pem van, nem tudtam kipr&oacute;b&aacute;lni.) <br>
7. Abel client. Ez egy BO szer&ucirc; administrator tool :) gyeng&eacute;bb 
k&eacute;pess&eacute;gekkel, els&otilde;sorban jelsz&oacute;ra ki&eacute;lezve. 
M&ucirc;k&ouml;dik LAN-on &eacute;s Interneten is. Az Abel szerver benne van 
a Cain 1.51-ben, ami mellesleg FREE szoftver is, az 1.0 m&eacute;g fizet&otilde;s 
volt. Term&eacute;szetesen crack l&eacute;tezett hozz&aacute;... :) Sajnos viszont 
a BreakDance rakott az Abel szerverbe egy figyelmeztet&otilde; ablakot, hogy 
&quot;You are under monitoring&quot;, sz&oacute;val nem az igazi... <br>
Van neki egy toggle password caching funkci&oacute;ja, amivel ki lehet kapcsolni, 
hogy a Windows megjegyezze a jelsz&oacute;kat. Ekkor viszont minden alkalommal 
&uacute;jra be kell &iacute;rni &otilde;ket. El tudja t&aacute;vol&iacute;tani 
az aktu&aacute;lis felhaszn&aacute;l&oacute; cached resources bejegyz&eacute;seit. 
<br>
Az eg&eacute;sz program Win alap&uacute;, sz&eacute;p, k&ouml;nny&ucirc; kezel&otilde;fel&uuml;lettel. 
Egy h&aacute;tr&aacute;nya, hogy az el&otilde;z&otilde; 10k-s programok mellett 
ez 600k f&ouml;l&ouml;tt van. </p>
<p><i>PWLTOOL</i> <br>
A Cainnak egy komoly vet&eacute;lyt&aacute;rsa. Mondhatjuk azt, hogy mindent 
tud, amit az el&otilde;z&otilde;r&otilde;l elmondtam. K&eacute;perny&otilde;v&eacute;d&otilde;, 
shared passwords, cached passwords, stb. Brute Force, Dictionary, &eacute;s 
m&eacute;g kett&otilde; t&ouml;r&eacute;si m&oacute;d van benne. A t&ouml;r&eacute;shez 
lehet a szabv&aacute;ny API h&iacute;v&aacute;s, &eacute;s a program &quot;m&oacute;dszere&quot; 
k&ouml;z&ouml;tt v&aacute;lasztani. Term&eacute;szetesen ez ut&oacute;bbi l&eacute;nyegesen 
gyorsabb. Sokkal jobb sebess&eacute;geredm&eacute;nyt lehet &iacute;gy el&eacute;rni. 
<br>
Ebben is megtal&aacute;lhat&oacute; a password lop&aacute;shoz egy kis tr&oacute;jai 
program. &Uacute;gy elb&uacute;jik, hogy m&eacute;g a trayben sincs, s&otilde;t 
ctrl+alt+del-re sem j&ouml;n el&otilde;. <br>
A programnak egy nagy hib&aacute;ja van. Nagyon p&eacute;nz&eacute;hes, &eacute;s 
regisztr&aacute;ltatni akarja mag&aacute;t. H&aacute;t ez felh&aacute;bor&iacute;t&oacute;! 
Nem gondolj&aacute;tok?&nbsp;Nincs valakinek a hatos verzi&oacute;hoz t&ouml;r&eacute;se? 
<br>
&nbsp; </p>
<p>A t&ouml;rt&eacute;net v&eacute;ge, ennyi &eacute;s k&eacute;sz! <br>
RSC (TM) </p>
</body>

</html>