<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content=
"HTML Tidy for Windows (vers 14 February 2006), see www.w3.org" />
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Interview mit Neo2k8</title>
<link rel="stylesheet" href="../css/php.css" type="text/css" />
</head>
<body>
<hr />
<pre>
<b>[+]</b><u>Topic: Interviews</u>
<b>[+]</b><u>Von: Perforin</u>
<b>[+]</b><u>Mit: Neo2k8</u>
<b>[+]</b><u>Return: <a href=
"javascript:history.back()">Interviews</a></u>
</pre>
<hr />
<pre>
<b>1) Hi Neo2k8, k&ouml;nntest du dich bitte f&uuml;r das DC MAG #2 einmal kurz vorstellen, wer du bist, von wo du kommst und was so deine Hobbys sind?</b>

        Sehr gerne.Also wie schon erw&auml;hnt ist mein Nickname in der Vx&egrave;r Szene "Neo2k8".
        Ich bin immoment 20 Jahre alt und progge seit dem ich 15 bin.
        Zurzeit lebe ich in Deutschland.Habe aber in ein paar Jahren vor mit meiner Freundin nach Spanien auszuwandern.
        Meine Hobbys au&szlig;er die Vx&egrave;r Szene sind unteranderem Gotcha, Autotuning,lesen ... 

<b>2) Wie hast du zu DarK-CodeZ gefunden und warum bist du bei uns aktiv?</b>
        
        Wie ich zu DarK-CodeZ gefunden habe wei&szlig; ich garnicht mehr.Ich wei&szlig; nur soviel das ich einer der ersten dort
        war.Fr&uuml;her hie&szlig;&acute;es ja noch Batch-RockZ =). Aktiv bin ich in diesem Board, da es mir Spa&szlig; macht anderen zuhelfen,
        sachen beizubringen, neues aus der Szence zu erfahren &amp; nat&uuml;rlich meine Codes vorzustellen.
        Aber auch das Team ansich ist *very nice*, sodass mir das modererieren sehr viel Spa&szlig; bereitet.

<b>3) Gibt es irgendwelche Projekte die du noch coden willst? Vielleicht sogar ein gr&ouml;&szlig;eres?</b>

        Immoment m&ouml;chte ich ersteinmal meine kleineren Projekte fertigstellen &amp; f&uuml;r ein gr&ouml;&szlig;eres Projekt fehlen mir
        atm leider die Ideen.Denn wenn soll es ja auch au&szlig;ergew&ouml;hnlich sein, als immer der selbe Kram =)

<b>4) Dir ist das Storm Botnet bestimmt bekannt durch den Storm-Worm, nun soll das Kraken-Netz noch gr&ouml;&szlig;er sein!H&auml;lst du diese hohen Infektionszahlen (~400.000 Zombies) f&uuml;r real?</b>

        Mh , ich denke mal das es wirklich sehr viele Zombies sind, aber 400.000 ?  Nunja das ist/w&auml;re ne ganzsch&ouml;ne ausma&szlig;e.
        Ich sch&auml;tze mal die Zahlen wurden einwenig gepusht,damit es sich *EXTREMER* anh&ouml;rt.
        Ich w&uuml;rde die ausma&szlig;e auf etwa 310.000 sch&auml;tzen.

<b>5) Bist du m&ouml;glicherweise auch Besitzer eines Bot-Nets? Wenn ja, k&ouml;nntest du uns die Ausma&szlig;e verraten und um welchen Bot Typ es sich handelt?</b>
        
        Ich besitze KEIN Botnet . Obwohl ich schon 3 oder 4 Bots f&uuml;r diesen Zweck geproggt habe.

<b>6) Hacksector ist weg, wie findest du das?</b>

        Nunja , ich finde/fand Hacksector ne gute *einsteiger* Community.Dort waren zwar 90% spinner &amp; Kiddys unterwegs,
        aber einige hatten doch wirklich etwas im Kopf.Ich war dort meist nur wegen der Coding Area unterwegs.
        Man musste aber auch, wenn man kein Kiddy bleiben wollte aus  "Diesem" Board aussteigen, da man irgentwann NICHTS mehr dazugelernt h&auml;tte.
        Deshalb finde ich es garnicht schlimm das es down ist.   

<b>7) Was machst du wenn dir ein Server eines Trojaner-Kiddies in die H&auml;nde f&auml;llt?</b>

        Ich untersuche ihn auf seine DynDns Addy, bzw Ftp Daten etc. und versuche noch weitere Informationen zubekommen.
        Ja danach wird halt ne normale Abuse geschickt &amp; gemeldet.

<b>8) Gibt es was, was die Deutsche VX Szene braucht deiner Meinung nach?</b>

        Ich w&uuml;sste jetzt atm nicht wirklich etwas. Habe mir auch noch keine wirklichen Gedanken dar&uuml;ber gemacht.

<b>9) &Uuml;ber welche Wege kann man dich kontaktieren? Gibt es vielleicht auch eine Website von dir?</b>

        Meine E-mail : Neo2k8@web.de
        &Uuml;ber Pm in DarK-CodeZ
        Icq : Auf freundliche Anfrage per E-mail oder Pm in DarK-CodeZ
        Mein Blog : www.codeware.de.am

<b>10) Danke f&uuml;r deine Zeit! Hier kannst du nun noch Freunde gr&uuml;&szlig;en oder dir sonst was von der Seele schreiben.</b>

        Greez goes to my Teammembers [ Sph1nX, Perforin, Rayden, ringwrath-4 ] the VIP-Members &amp; my other Friends
</pre>
</body>
</html>
