<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content=
"HTML Tidy for Windows (vers 14 February 2006), see www.w3.org" />
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Interview mit SkyOut</title>
<link rel="stylesheet" href="../css/php.css" type="text/css" />
</head>
<body>
<hr />
<pre>
<b>[+]</b><u>Topic: Interviews</u>
<b>[+]</b><u>Von: Perforin</u>
<b>[+]</b><u>Mit: SkyOut</u>
<b>[+]</b><u>Return: <a href=
"javascript:history.back()">Interviews</a></u>
</pre>
<hr />
<pre>
<b>1) Hi SkyOut, k&ouml;nntest du dich bitte f&uuml;r das DC MAG #2 einmal kurz vorstellen,
wer du bist, von wo du kommst und was so deine Hobbys sind?</b>

Servus "Nachbar" (200 Kilometer Entfernung)!

Die meisten Leute kennen mich wohl als SkyOut oder Sky, sogar ein paar Freunde
aus der Gegend hier haben sich schon angew&ouml;hnt nur noch diesen Namen zu verwenden.
F&uuml;r den Rest bin ich Marcell Dietl, geboren in Wiesbaden und bald 20 Jahre alt.

&Uuml;ber die Jahre hinweg, haben viele Einfl&uuml;sse sich in meine Entwicklung eingeklingt,
geblieben ist seit mehreren Jahren die Gothic Szene und noch einige andere alternative
Gruppen (Visual Kei, Punk, Emo...). Das w&auml;re die eine H&auml;lfte meiner Person, ein dunkel
angezogener junger Kerl, der auf Parties geht und gerne mal etwas extremer Auftritt.

Daneben und das ist wohl das, was die meisten schon kennen, gibt es noch den Geek,
Nerd, Computerfreak oder wie auch immer man es nennen will, der an allen m&ouml;glichen
technischen Sachen Faszination findet und so manchen schon verwunderte in der
Exzessivit&auml;t, mit der er es tut (so kam es auch schonmal vor, dass ich keine Zeit
hatte gescheit f&uuml;r eine Klausur zu lernen, weil ich noch die Konfiguration eines
Systems verbessern wollte).

Wer mehr wissen will, kann fragen! (siehe Frage 9)

<b>2) Von wo kennst du DarK-CodeZ?</b>

Gute Frage... Warst du es nicht, der mich darauf aufmerksam machte dieses Jahr?
Mit der Zeit hat sich das dann eben ergeben, dass ich das Projekt verfolgte und das wir
wohl gegenseitig unsere Blogs lesen und auch mal auf den jeweils anderen hinweisen.

Ich k&ouml;nnte mich irren, aber ich glaube als ich von dem ersten E-Zine von Euch h&ouml;rte,
hab ich auch Izee von EOF-Project angesto&szlig;en, darauf hinzuweisen, was er auch p&uuml;nktlich
am 24.12.2007 tat. Sp&auml;testens ab da muss ich es also verfolgt haben...

<b>3) In welchen "Szenen" warst du, und bist du momentan aktiv? Was reizt dich dabei?</b>

Hehe... Okay, kann man weit auslegen die Frage. Ich beziehs mal auf technisch orientierte
Szenen und da ist es eigentlich sehr &uuml;bersichtlich: Ganz fr&uuml;her war es noch Gaming
(CS und CS:S), das hab ich mir aber nach einer recht kurzen Zeit abgew&ouml;hnt, weil der Reiz
weg war. Danach kam dann irgendwann die VX Szene, in welche ich etwas neuen Schwung durch
Gr&uuml;ndung von Xero versuchte zu kriegen und sp&auml;testens nach dem Umbau zu EOF schien das wohl
auch gut zu funktionieren. Izee f&uuml;hrt es jetzt bestens weiter und wir sind in regelm&auml;&szlig;igem
Kontakt. Danach kam dann die... ja, wie nennt man sie denn nun... Security Szene? Hacking
Szene?

Jedenfalls faszinierte mich das noch um Welten mehr als es VX jemals tat, da das Spektrum
weit gr&ouml;&szlig;er ist. VX ist relativ "beschr&auml;nkt", bei Security kann so ziemlich alles eine Rolle
spielen: Physical Security, Network Security, Host Security, Web Security und so weiter.
Ich versuche das ganze etwas zu kombinieren, wie zum Beispiel mit dem Zakoomy XSS Wurm.
Es ist wohl eine Mischung aus Web Security gepaart mit der Spannung die VX mit sich bringt:
Etwas zu programmieren, was potentiell auch gro&szlig;en Schaden anrichten k&ouml;nnte.

<b>4) Welche Programmiersprachen kannst du?</b>

Die Websprachen vorwiegend, da ich 'ne Menge damit spielen musste bisher, sei es f&uuml;r
die Erstellung von Webseiten oder f&uuml;r das Thema Web Security, also: (X)HTML, PHP, CSS,
JavaScript...

Meine Lieblingssprache ist ansonsten Ruby oder f&uuml;r kleinere Dinge auch mal Shell. Mit C#
schreibe ich meistens Programme, welche eine GUI haben sollen und nicht zu umfangreich sind.
Ist wohl 'ne Gew&ouml;hnungssache... Nachdem ich das erste GUI Programm in C# erstellte, hab ich
es immer wieder mal genommen und Gefallen daran gefunden.

Im Moment versuche ich mich mit ASM und C zu besch&auml;ftigen, vor allem, um im Thema Security
endlich weitere Schritte gehen zu k&ouml;nnen.

<b>5) Gibt es vielleicht Projekte von denen du uns erz&auml;hlen willst?</b>

Ideen hab ich zu viele, nur an der Umsetzung hapert es gerne einmal. Im Prinzip m&ouml;chte
ich nur Andeutungen machen und nicht zu viel versprechen, aber f&uuml;r 2009 sind neue Artikel
f&uuml;r Magazine geplant (bisher nur Hakin9, bald vielleicht noch mehr). Au&szlig;erdem bereite ich
neue Vortr&auml;ge vor und spreche mich diesmal mit erfahrenen Personen ab, damit es diesmal
qualitativ gut wird und das Publikum erfreut und nicht zu derart kontroversen Diskussionen,
wie nach dem 24c3 f&uuml;hrt. Einige Tools sind ansonsten in Planung, die zusammen mit anderen
wohl bald in die Startphase gehen. Lasst Euch einfach mal &uuml;berraschen, mal sehen, was aus
den Ideen so wird!

<b>6) Was tust du f&uuml;r deine Sicherheit im Netz?</b>

Skeptisch sein, gegen&uuml;ber allem... Das half irgendwie immer. Ich nutze zwar ebenso Software
und Hardware Firewalls sowie Virenscanner und andere Sachen, aber seit ich mich mit dem
Thema auseinandersetzte passierte nie mehr wirklich viel. Liegt wohl daran, dass die meisten
Schadprogramme einfach nur "idiotisch" verbreitet werden. Ich m&ouml;chte ein Video gucken und
man bietet mir an, dass ich doch den Flash Player von einer x-beliebigen Seite herunterladen
k&ouml;nnte. Wozu? Den hab ich doch l&auml;ngst...

Ab und an installier ich auch mein System komplett neu, meistens weniger aus der Angst heraus
es k&ouml;nne kompromittiert sein, sondern vielmehr um unn&uuml;tzen M&uuml;ll loszuwerden und wieder von
Null anzufangen.

Passw&ouml;rter sind meist sehr paranoid, Spamfilter auch... Das &Uuml;bliche eigentlich nur, was die
meisten von den Lesern kennen sollten.

<b>7) Was h&auml;lst du vom Herr Sch&auml;uble?</b>

Wahrscheinlich erwartest du, dass ich ihn hier fertig mache?! Nein, eigentlich kann ich den
Mann nachvollziehen. Ich sags mal mit den Worten eines langj&auml;hrigen Freundes:
"Er will halt nicht als der Innenminister in die Geschichte eingehen, der nichts unternommen
hat.".

Und genau so ist es. Die Leute bekommen, was sie fordern. Wenn die Masse glaubt, dass sie
sicherer sei vor Selbstmordattent&auml;tern wegen Kameras, na dann... Ich frag mich zwar immer noch
was einem die Kamera bringt, wenn jemand mit 'nem G&uuml;rtel in 'nen Zug rennt und sich in die Luft
sprengt. Au&szlig;er dass die Menschen von den Bildern noch mehr Angst kriegen und noch mehr akzeptieren
f&uuml;r ihre "Sicherheit" f&auml;llt mir da nicht allzu viel ein.

Kurz und knapp: Ich bin gegen das was passiert, aber kann nachvollziehen warum es passiert.

<b>8) Setzt du dich auch im RL gegen den &Uuml;berwachungswahn ein?</b>

Ja, tue ich. Ich rede viel mit Menschen dar&uuml;ber, manche kann man &uuml;berzeugen, andere nicht.
So baue ich mir halt den Kreis von Personen auf, denen ich glaube vertrauen zu k&ouml;nnen. Es sind
wenige, aber so ist es nunmal.

Ansonsten schau dir doch das einfach mal an:
http://www.cccmz.de/?p=218

Sollte deine Frage wohl bestens beantworten!

<b>9) Hast du eine Webseite oder andere Kontaktm&ouml;glichkeiten?</b>

Seit 2008 ist es Wired-Security.net (HTTP/S) und die Email
skyout[-at-]wired-security[-dot-]net.

Doch es kommt wohl bald zu einer Umstrukturierung, einem Hosterwechsel und so weiter. Doch
das wird dann fr&uuml;h genug dort zu lesen sein, einfach abrupt offline werde ich die Seite
nicht nehmen. Ansonsten ICQ, MSN und Jabber, aber zuerst w&auml;re eine Email nett mit einer
kurzen Vorstellung. Es landeten schon zu viele Leute auf meiner Liste f&uuml;r nur wenige Tage,
daran verliere ich langsam das Interesse.

<b>10) Das w&auml;rs auch schon! Hier kannst du dir noch was von der Seele schreiben
(Greetings zB)!</b>

Ich denke ich hab genug erz&auml;hlt! Will ja nicht jegliche Spannung wegnehmen, falls irgendjemand
doch mal auf dieses Interview hin mit mir in Kontakt tritt. Gr&uuml;&szlig;en werde ich keine Einzelpersonen
hier, weil das zu viele werden w&uuml;rden und sich die Liste der Personen, die ich sch&auml;tze, schnell
&auml;ndern kann. Wer mir derzeit wichtig ist, wird es schon wissen.

Der einzige Gru&szlig; geht an die Leute des Helith Network, mit denen ich schon eine Menge Spa&szlig; im
VL und RL hatte und nun endg&uuml;ltig eine noch st&auml;rkere Zusammenarbeit meinerseits anstrebe.

*Zigarette anz&uuml;nden und wieder in den Schatten zur&uuml;ckziehen*
</pre>
</body>
</html>
