<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content=
"HTML Tidy for Windows (vers 14 February 2006), see www.w3.org" />
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Interview mit Sph1nX</title>
<link rel="stylesheet" href="../css/php.css" type="text/css" />
</head>
<body>
<hr />
<pre>
<b>[+]</b><u>Topic: Interviews</u>
<b>[+]</b><u>Von: Perforin</u>
<b>[+]</b><u>Mit: Sph1nX</u>
<b>[+]</b><u>Return: <a href=
"javascript:history.back()">Interviews</a></u>
</pre>
<hr />
<pre>
<b>1) Hi Sph1nX, k&ouml;nntest du dich bitte f&uuml;r das DC MAG #2 einmal kurz vorstellen, wer du bist, von wo du kommst und was so deine Hobbys sind?</b>

Sph1nX aka Dennis 
du bist so wunderbar,Berlin 
Standartprogramm, Skaten,Saufen,Party machen,am Rechner rumeiern wenn nix los is 
 
<b>2) Wie hast du zu DarK-CodeZ gefunden und warum bist du bei uns aktiv? </b>

Gefunden durchs Gr&uuml;nden :P 
Aktiv nicht mehr aus Interesse am Coden,sonder zur Wartung und Unterhaltung 
 
<b>3) Gibt es irgendwelche Projekte die du noch coden willst? Vielleicht sogar ein gr&ouml;&szlig;eres? </b>

Da mir die Lust vergangen ist und die Zeit mir nicht reicht, nicht aus eigener Hand. 
Aber um Ideen zu bringen bin ich noch f&auml;hig :P 
 
<b>4) Dir ist das Storm Botnet bestimmt bekannt durch den Storm-Worm, nun soll das Kraken-Netz noch gr&ouml;&szlig;er sein! 
H&auml;lst du diese hohen Infektionszahlen (~400.000 Zombies) f&uuml;r real? </b>

Warum nicht? Die Diplomarbeit dar&uuml;ber habe ich gelesen, in gewissen Punkten wirklich aufschlussreich. 
Au&szlig;erdem gibts mehr als genug Idioten da drau&szlig;en, die meinen ihren PC nur zum chatten und ebayen zu gebrauchen und bereits etliche Viren,Trojaner,Mal- &amp; Spyware auf dem System haben. 
 
<b>5) Bist du m&ouml;glicherweise auch Besitzer eines Bot-Nets? Wenn ja, k&ouml;nntest du uns die Ausma&szlig;e verraten und um welchen Bot Typ es sich handelt? </b>

Nein bin ich nicht (war da nicht mal was?) Ich hatte vor ein paar Jahren zwar einige Rechner unter Kontrolle jedoch leider nicht mit einem Bot. 
Mittlerweile bin ich aber auch aus dem Bereich weg, also tut das nichts mehr zu Sache. 
 
<b>6) Hacksector ist weg, wie findest du das? </b>

Traurig f&uuml;r die, die eine Hausdurchsuchung hatten. Vorallem AnubiZz, da der mir damals viel geholfen hat, mir Space auf seinem Server zur Verf&uuml;gung stellte. (Ich dr&uuml;ck dir die Daumen!) 
Zum Forum, naja es war gut zum austauschen, jedoch wurde es immer schlechter und schlechter, zu viele Idioten ohne Ahnung, Spammer und andere Konsorten... 
Die Themen wurden zum Schluss auch immer heftiger, ich konnte Faker noch nie leiden, da ich kein Vertrauen zu Betr&uuml;gern aufbauen kann, die ich nicht kenne. 
Ich bin mir sicher, es gibt viele die eine Abneigung gegen Leute hegen, die faken, geklaute CC\'s benutzen und anderen Schaden zuf&uuml;gen. 
 
<b>7) Was machst du wenn dir ein Server eines Trojaner-Kiddies in die H&auml;nde f&auml;llt? </b>

Meistens bin ich zu faul f&uuml;r den Mist aber wenn mir danach ist, dann... 
Fahr ich VMWare hoch, zieh den Server rauf, starte ihn, betrachte mir die IP in der Firewall und gebe diese an die Abuseabteilung des Providers weiter ( Firewall weil zu faul zum IP per HEX-Editor suchen :P ) 
 
<b>8) Gibt es was, was die Deutsche VX Szene braucht deiner Meinung nach? </b>

St&auml;rkere gruppierungen, es m&uuml;ssen Zeichen gesetzt werden, vorallem gegen diesen Schwachkopf von Sch&auml;uble... 
Man muss sich zeigen und dennoch unerkannt bleiben. Ach ja und die Kriege untereinander...einfach d&auml;mlich. 
Wir fordern auch niemanden heraus, aber wenn jemand ein Problem hat kann man leider wenig machen. 
Speziell wenn die Experten ankommen und ihr Botnet auspacken weil sie es nicht anders schaffen -.-\' 
 
<b>9) &Uuml;ber welche Wege kann man dich kontaktieren? Gibt es vielleicht auch eine Website von dir? </b>

Mich kontaktieren ist einfach, jedoch habe ich nachdem ich st&auml;ndig von den gr&ouml;&szlig;ten Noobs immer zugelabert wurde (Trojaner stealthen etc. *w&uuml;rg*) meine Addys aus so ziemlich allen Foren entfernt. 
Trotzdem bin ich per ICQ,MSN,Email und f&uuml;r manche auch per Telefon/Handy erreichbar. Meine Webseite sollte jeder kennen, der diesen Text liest ;) 
 
<b>10) Danke f&uuml;r deine Zeit! Hier kannst du nun noch Freunde gr&uuml;&szlig;en oder dir sonst was von der Seele schreiben. </b>

Gr&uuml;&szlig;e gehen raus an: 
all unsere Partnerseiten 
das DarK-CodeZ Team (Perforin aka broken-error, ringwrath-4, Rayden, Neo2k8) 
Cactus 
n0x 
AnubiZz 
Neo2k4 
BlackSoul 
enco 
EThaNol (der auf mich aufpasst wenn ich besoffen nicht mehr laufen kann) 
und meine Mom weil die mir immer meine Pizzen macht :P 
 
Soweit wars das, mein Alzheimer l&auml;sst nicht mehr Gr&uuml;&szlig;e zu ^^ 
Nicht lang schnacken, Kopp in Nacken. Guten Durst dann noch!
</pre>
</body>
</html>
