<!doctype html public "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>tutorial</title>
<meta name="author" content="below...">
<meta name="generator" content="Ulli Meybohms HTML EDITOR">

<style type="text/css">
body {
scrollbar-face-color: #000000;
scrollbar-shadow-color: #FF0000;
scrollbar-highlight-color: #FF0000;
scrollbar-3dlight-color: #FF0000;
scrollbar-darkshadow-color: #FF0000;
scrollbar-track-color: #000000;
scrollbar-arrow-color: #FF0000;
}
</style>

</head>
<body text="#FFFFFF" bgcolor="#000000" link="#FFFFFF" alink="#FFFFFF" vlink="#FFFFFF">
 <font color="#FF0000">
  <h4>
   <div align="center">
    Du weisst doch wie das ist... &nbsp;&nbsp;&nbsp;[by El DudErin0]
   </div>
  </h4>
 </font>

 <pre>
  <font face="fixedsys">

  Du weisst doch wie das ist...

  Es kommt f&uuml;r dich ziemlich unerwartet. Gerade eben bist du noch auf irgendeiner
  Party zusammen mit deinen Kumpels und diesem einen bischen durchgedrehten Typ
  mit Dreadlocks, der euch was von seinem &quot;allerbesten Gras &uuml;berhaupt&quot;
  mitrauchen l&auml;sst. Die Bong wandert in deinem nun erweiterten Freundeskreis.
  Flamme, Blubbern, Husten, weiter. Du setzt zu deinem ersten Kopf an. Also das
  Feuerzeug ans Gras gehalten und los gehts. Du saugst den Rauch bis in die kleinsten
  Kapillaren deiner Lunge weil du auf das Versprechen bez&uuml;glich der Qualit&auml;t
  misstrauisch bist. Die Hippies erz&auml;hlen andauernd davon, ihr ausgetrocknetes
  Stengel- und Samenverseuchtes Br&ouml;selzeug sei das Beste das man irgendwoher
  bekommen k&ouml;nne.

  Das Gras verbrennt in einem unwahrscheinlich kurzen Zeitraum und zur&uuml;ck
  bleibt nur Asche, die in die Bong gesaugt wird. In der Bong steht noch der Rauch
  und deine Lungen sind zum Platzen voll, aber du saugst weiter und l&auml;sst
  das Kickloch los. Du sp&uuml;rst den Vorschlaghammer, der auf deinen Hinterkopf
  einschl&auml;gt und f&auml;ngst an zu husten bis deine Atemwege brennen. Du
  streckst die Bong auf Arml&auml;nge von dir weg zum n&auml;chsten im Kreis,
  hoffst er wird sie dir in weniger als einer Milisekunde entreissen und stehst
  auf. Du brauchst jetzt was zu trinken. Dein Mund ist ausgetrocknet und du brennst
  innerlich.

  OK. Wo gehts zur K&uuml;che hier? Da muss doch was zu Trinken sein. Um dich
  herum: ein T&uuml;rrahmen. Zwei Typen unterha&ouml;lten sich miteinander. Jeder
  von ihnen eine Bierflasche in der Hand. Du gehst auf sie zu und willst an ihnen
  vorbei. Ein Erdbeben ersch&uuml;ttert dich. Wo bist du? Konzentrieren. Etwas
  zu trinken. Du gehst immernoch weiter. Du blickst dich um, und als du merkst,
  dass dein T-Shirt nass ist siehst du die beiden Typen von gerade eben die wild
  in deine Richtung gestikulieren. Aber wo ist nun die K&uuml;che. Du w&uuml;rdest
  jemanden fragen, wenn du jetzt ein Wort rausbringen k&ouml;nntest, ohne vom
  darauffolgenden Schwindelgef&uuml;hl umzukippen. Noch eine T&uuml;r, die mit
  rasender Geschwindigkeit auf dich zu kommt. Du versuchst dem Rahmen auszuweichen
  und schl&uuml;pfst durch die Mitte hindurch in einen hellen Raum, der mit allerlei
  glitzernden Amaturen ausgestattet ist, und du merkst dass du wirklich die K&uuml;che
  gefunden hast. &quot;Scheisse!&quot; Wer hat das gesagt? Du siehst dich um,
  aber bevor du jemanden ausmachen kannst f&auml;llt dein Blick auf einen Wasserhahn.
  &quot;Der Typ sieht aber nicht mehr fit aus.&quot; Der soll bloss die Fresse
  halten. Was mischt er sich auch ein? Das ist jetzt eine Sachen allein zwischen
  dir und dem Wasser. Du drehst den Hahn auf, f&auml;ngst etwas Wasser mit deinen
  H&auml;nden und trinkst daraus. So glasklar wie dir das Wasser auch vorkommt,
  geistig hat es dich nicht wieder fit gemacht. Daf&uuml;r hat sich das Brennen
  beruhigt und du denkst wieder dar&uuml;ber nach mit anderen Leuten Kontakt aufzunehmen.

  &quot;...Guter Scheiss, Alter...&quot; Durch deine halboffenen Lider siehst
  du einen Typen auf dich zukommen. &quot;...probieren?&quot; Er hat eine abgebrochene
  Zigarette im Mundwinkel h&auml;ngen und zwinkert dir zu. &quot;...aus Paris...&quot;
  Er sieht zwar nicht aus wie ein Franzose aber als er dir seinen Becher entgegenstreckt
  reisst du ihn ihm, ohne wirklich jemals den Wunsch dazu auch nur gedacht zu
  haben, aus der Hand, trinkst ihn aus und wirfst ihn mit der einen Hand hinter
  dich - &quot;...Absinth...&quot;- w&auml;hrend du dir mit der anderen den Mund
  abwischt. Du reisst deine Augen so weit auf wie es dir nur m&ouml;glich ist
  und siehst den Typen an, der wahrscheinlich genauso entgeistert auf dich zur&uuml;ckstarrt.
  Spiegelbild.

  Actio = reactio. In deinem Fall w&auml;re die Aktion der gr&auml;sslich-beissende
  Geschmack des Absinth den du dir gerade in einer netten 0,3 Liter Portion verabreicht
  hast. Deinem Spiegelbild reicht f&uuml;r die gleiche Reaktion schon nur der
  Anblick einer Person aus, die sich auf solch skrupellose Weise toxischen Einfl&uuml;ssen
  hingibt.

  Du weisst jetzt nicht genau wie es weitergehen soll und ausserdem willst du
  nicht die perfekte &Uuml;bereinstimmung mit deinem halb nach vorne &uuml;bergebeugten
  Spiegelbild kaputt machen, das dich mit weit offenem Mund und noch weiter afgerissenen
  Augen nach&auml;fft. &quot;Oh scheisse...&quot; Und du kippst lautlos und in
  Zeitlupe zur Seite hin um.

  ---

  Du machst die Augen wieder auf ohne dich an einen Aufprall am Boden zu erinnern
  und bemerkst dass du schon wieder stehst oder noch garnicht umgefallen bist.
  Aber bevor du dir dar&uuml;ber den Kopf zerbrechen kannst sp&uuml;rst du das
  Stechen in deinen Augen. Es ist so hell, dass es wie das andere Extrem von Blindheit
  f&uuml;r dich ist. Und du f&auml;llst ein weiteres Mal um, und diesmal tut es
  so weh, dass du laut losschreist.

  ---

  Als du das n&auml;chste Mal zu dir kommst machst du die Augen wieder auf, und
  bleibst diesmal ungestraft. Was du siehst ist ein Engel. Aber er ist nicht weiss
  und gl&auml;nzend sondern seine Fl&uuml;gel und sein Gewand sind &ouml;lversschmiert
  und er tr&auml;gt Arbeitshandschuhe und einen gelben Schutzhelm. Ausserdem h&auml;ngt
  in seinem Mundwinkel unmotiviert eine abgebrochene Zigarette. Er steht mit dem
  R&uuml;cken zu dir und schl&auml;gt mit einem Vorschlaghammer auf einen Stein
  ein, dem du eine gewisse &Auml;hnlichkeit mit deinem Kopf zugestehst.

  </font>
 </pre>

</body>
</html>