<!doctype html public "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>tutorial</title>
<meta name="author" content="below...">
<meta name="generator" content="Ulli Meybohms HTML EDITOR">

<style type="text/css">
body {
scrollbar-face-color: #000000;
scrollbar-shadow-color: #FF0000;
scrollbar-highlight-color: #FF0000;
scrollbar-3dlight-color: #FF0000;
scrollbar-darkshadow-color: #FF0000;
scrollbar-track-color: #000000;
scrollbar-arrow-color: #FF0000;
}
</style>

</head>
<body text="#FFFFFF" bgcolor="#000000" link="#FFFFFF" alink="#FFFFFF" vlink="#FFFFFF">
 <font color="#FF0000">
  <h4>
   <div align="center">
    Die unergr&uuml;ndlichen Wege der Kunst &nbsp;&nbsp;&nbsp;[by El DudErin0]
   </div>
  </h4>
 </font>

 <pre>
  <font face="fixedsys">

  Die unergr&uuml;ndlichen Wege der Kunst


  K&uuml;rzlich besuchte ich eine Kunstgallerie nicht weit entfernt von goatse.cx
  und ccn.com. Es waren viele Werke j&uuml;ngerer K&uuml;nstler zu begutachten,
  und nicht eines davon war Porno. Doch es kam viel besser:



  Ich schlenderte durch die endlosen Reihen an belanglosen Versuchen der K&uuml;nstler
  sich in das Hirn eines dreij&auml;hrigen zu versetzen und tolle Farbkreationen
  zu erschaffen. Doch dann erblickte ich in der Ecke hinter einem Papierkorb einen
  zusammengefalteten Zettel. Ich bin ja ziemlich neugierig und deswegen ging ich
  zum Papierkorb. Ich sah mich um, damit mich nicht eine alte Museumsw&auml;rterin
  f&uuml;r einen Penner hielt und mich hinauswarf, wenn ich den Zettel aufheben
  w&uuml;rde. Ich nahm das St&uuml;ck Papier an mich und ging weiter. Als ich
  an der M&auml;nnertoilette vorbeikam, betrat ich sie und schloss mich in einer
  der Kabinen ein. Ich entfaltete das Papier in der Erwartung irgendein wichtiges
  Dokument gefunden zu haben. Was ich jedoch fand war dies:

  <img src="../pics/kidpic1.jpg">


  Der kleine James Hansard hatte diese liebliche Zeichnung gestaltet. Die Bild&uuml;berschrift
  lautete: &quot;This is Tim The yowie man scaring everyone.&quot; Auf dem Bild
  sah man eine monstr&ouml;se Gestalt auf die vielerlei V&ouml;gel Kurs genommen
  hatten, und die mit ihrem dezent angedeuteten Schrei einige Menschen zum weglaufen
  brachte. Die Farbwahl und der Zeichenstil erinnerten mich sofort an die erstklassigen
  Illustrationen von Hunter S. Thompsons &quot;Fear and Loathing in Las Vegas&quot;.
  Der Charme der Zeichnung hatte mich vollkommen in ihren Bann gezogen. Im linken
  oberen Bildrand war eine sehr coole, aggressive Sonne zu sehen, die blutrot
  gef&auml;rbt war. Ich starrte einige Zeit auf das Bild, bis ich pl&ouml;tzlich
  wieder zu mir kam und mir bewusst war, dass ich in einer Toilette sa&szlig;.
  Ich beschloss zu gehen, doch vorher klaute ich mir noch einige dieser Papiert&uuml;cher
  mit denen man sich die H&auml;nde abtrocknet.

  Dem Rest der Ausstellung schenkte ich kaum mehr beacht; ich hatte schliesslich
  ein Meisterwerk in meiner Tasche, dass ich mir n&auml;her begutachten musste.
  Ich holte meinen Mantel an der Garderobe ab und begab mich nach draussen, wo
  die Welt mit aller Kraft versuchte unterzugehen. Ich nam also ein Taxi um nach
  Hause zu kommen.

  Ich st&uuml;rmte in meine Wohnung und fiel fast &uuml;ber einen Stapel CD-Rohlinge.
  Ich habe die Dinger fast &uuml;berall in der Wohnung aufget&uuml;rmt. Oben auf
  jedem habe ich einen Halogenstrahler draufgelegt, und so dienen sie mir als
  Deckenfluter, die so tolles unaggressives Licht machen.

  Jedenfalls versuchte ich ersteinmal den Namen &quot;James Hansard&quot; irgendwo
  im Internet zu finden. Leider fand ich nur tausende Pornoseiten, die mir hoch
  und heilig versprachen, wenn ich 23 &euro; im Monat zahlen w&uuml;rde, g&auml;ben
  sie mir Britney Spears als meinen pers&ouml;nlichen Sklaven dazu. Deswegen bezog
  ich neben der Suchmaschine meine zweitverl&auml;sslichste Quelle in die Recherche
  mit ein; der AOL-Teen-Chat. Ich begab mich in den Channel f&uuml;r meine Stadt
  und traf nachdem ich einige Pokemon-Schlachtrufe abgegeben hatte, &quot;SexyGrrrl420&quot;.
  Ich hatte eine sch&ouml;ne Konversation und nach dem Cybersex mit ihr auch eine
  &uuml;berdurchschnittlich hohe Befriedigung meiner paedophilen Triebe. Sie schickte
  mir nachdem ich sie darum bat ein Bild von ihr:

  <img src="../pics/westcowst.jpg">


  Das Tattoo auf ihrer Taille war nicht zu &uuml;bersehen. Da stand doch wirklich
  &quot;Hansard's Fuckbeast&quot;. Ich musste sofort mit ihr weitersprechen. Sie
  erz&auml;hlte mir, dass sie als sie das erste Mal Marijuana konsumierte, so
  von Sinnen gewesen sei, einen dreij&auml;hrigen Jungen gebeten zu haben ihr
  ein Tattoo mit einer eiterverkrusteten Fixernadel auf ihren Bauch zu ritzen.
  Als sie am n&auml;chsten Tag aufwachte war sie Hansard's Fuckbeast. Also, mit
  diesem kleinen Mann muss ich mich unbedingt mal anfreunden, wenn ich ihm &uuml;ber
  den Weg laufe, der ist mir echt sympatisch.

  Ich beendete so meine allt&auml;gliche Wichssession, und setzte mich in meinen
  Sessel. Da fiel mir das Bild wieder ein. Ich holte es heraus und bemerkte erst
  jetzt, das dieser kleine dreij&auml;hrige Typ der gleiche war, der auch das
  Bild gemalt hatte. Ich rannte wieder zum PC und setzte mich nocheinmal mit meiner
  Informantin in Kontakt. Bei dieser Gelegenheit lies ich mir nochmal ein Bild
  von ihr schicken:

  <img src="../pics/gaengsta.jpg">


  Sie sagte, dieses Bild sei einen Tag vor dem Fixertattoo Spektakel gemacht
  worden, deswegen w&uuml;rden sie und ihre Freundin auch so fr&ouml;hlich dreinschauen.
  Das machte mich geil. Ich holte mir nochmal einen runter.

  </font>
 </pre>

</body>
</html>