<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<title>ASM Rulez - 1. r&eacute;sz</title>
<meta name="generator" content="Namo WebEditor v3.0">
</head>

<body background="bg2.gif" bgcolor="white" text="black" link="blue" vlink="purple"
 alink="red">

<p>&nbsp;</p>
<p><font face="Courier New">&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;<br>
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml;&Uacute;&Auml;<br>
&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&Uacute;&Auml;&Auml; 
&nbsp;&Uacute;&Auml;<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute; &nbsp;&nbsp;&Uacute;&Auml; 
ASSEMBLY RULEZ<br>
&Uacute;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;I.r&eacute;sz<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;</font></p>
<p>&nbsp;</p>
<h2 align="center"><font face="Comic Sans MS">Programozzunk ASSEMBLY-ben!</font></h2>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ezt a cikket azoknak 
&iacute;rtam, akik tudnak m&aacute;r valamit a sz&aacute;m&iacute;t&oacute;g&eacute;pr&otilde;l,&nbsp;esetleg 
tudnak valamilyen programnyelven (ez nagyon j&oacute; lenne) &eacute;s most 
&uacute;gy &eacute;rzik itt az id&otilde; egy szinttel feljebb (lejjebb) l&eacute;pni 
&eacute;s szeretn&eacute;k megismerni az assembly gy&ouml;ny&ouml;rs&eacute;geit. 
A cikk a majdnem kezd&otilde;knek sz&oacute;l els&otilde;sorban (legal&aacute;bbis 
ez a r&eacute;sz), ez&eacute;rt ha m&aacute;r tudsz egy kicsit assembly&uuml;l, 
akkor vagy ne olvasd el (de tal&aacute;n hasznos lehet, ha nem vagy mindennel 
tiszt&aacute;ban) vagy ne bosszankodj azon, hogy milyen &quot;alap&quot; dolgokat 
is le&iacute;rtam. Vannak akiknek ezek m&eacute;g ismeretlenek. Ja, ha valami 
nagy baroms&aacute;got &iacute;rtam volna, akkor miel&otilde;bb contactolj meg, 
hogy felvil&aacute;gos&iacute;thass!<br>
&nbsp;&nbsp;&nbsp;Akkor v&aacute;gjunk is bele!</font></p>
<p><font face="Comic Sans MS"><u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El&otilde;sz&ouml;r 
is mi az az assembly nyelv?</u></font><font face="Comic Sans MS"><br>
Nos ez a processzor saj&aacute;t bels&otilde; (g&eacute;pi) nyelve (na j&oacute; 
nem teljesen az, hanem annak egy emberi form&aacute;ja). Mindenki tudja (vagy 
sem), hogy a proci mindenf&eacute;le cs&uacute;nya bin&aacute;ris (h&aacute;t 
ez mi a fene?) sz&aacute;mokkal dolgozik, ezek &iacute;rj&aacute;k le az utas&iacute;t&aacute;sokat 
meg az adatokat. Nemtom kinek lenne kedve p&aacute;r sz&aacute;z bin&aacute;ris 
- jobb esetben hexa - sz&aacute;mot megtanulva programozni. Erre tal&aacute;lt&aacute;k 
ki az okosok a mnemonikokat (nem k&aacute;romkodom, elmondom mi ez). Ezek az 
adott g&eacute;pi utas&iacute;t&aacute;s angol nyelvñ r&ouml;vid&iacute;t&eacute;sei 
pl.: ADD - ADDition. Vannak enn&eacute;l cifr&aacute;bbak, de egyszer&ucirc;bbek 
is. Most m&aacute;' csak egy gond van. Ezeket a g&eacute;p nem hajland&oacute; 
megenni. Itt j&ouml;ttek a m&eacute;g okosabbak &eacute;s csin&aacute;ltak egy 
ASSEMBLERt. Ez semmi m&aacute;s, mint egy ford&iacute;t&oacute; program, ami 
mint a nev&eacute;b&otilde;l is l&aacute;tszik ASSEMBLY programokat ford&iacute;t 
le az adott op. rendszer alatt futtathat&oacute; form&aacute;ba. Most ak&aacute;r 
neki is &aacute;lhetn&eacute;nk &eacute;let&uuml;nk els&otilde; assembly programj&aacute;nak, 
csakhogy nem tudunk sem assemblyben sem a ford&iacute;t&oacute; &aacute;ltal 
k&eacute;rt file form&aacute;tumot nem ismerj&uuml;k. Sebaj!! Itt vagyok &eacute;n 
&eacute;s majd &uacute;gy ahogy magyar&aacute;zgatok, amit tudok (egy&eacute;bk&eacute;nt 
rengeteget tudok, csak ne lenn&eacute;k ilyen szer&eacute;ny).</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br> </font>
<table border>
    <tr>
        <td width="162"><p><font face="Comic Sans MS">SZ&Aacute;MRENDSZEREK 
            </font></td>
    </tr>
</table>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Kezdetnek egy kis 
bin&aacute;ris &eacute;s hexa aritmetika. Most nagy leveg&otilde;, mert itt 
a nagy pillanat, amikor sz&uuml;ks&eacute;g lehet a suliban tanultakra. Mindenki 
hallott m&aacute;r a sz&aacute;mrendszerekr&otilde;l. Ezek k&ouml;z&uuml;l mi 
a TIZESt haszn&aacute;ljuk, de vannak m&aacute;sok is. A f&ouml;n&iacute;ciaiak 
a 60-ast haszn&aacute;lt&aacute;k, m&aacute;sok m&aacute;st. A sz&aacute;m&iacute;t&oacute;g&eacute;p 
a kettes, vagy m&aacute;s n&eacute;ven BIN&Aacute;RIS sz&aacute;mrendszert &eacute;rti 
meg. Ennek egyszer&ucirc; oka, hogy a g&eacute;p sz&aacute;m&aacute;ra csak 
1 vagy 0 l&eacute;tezik. Neki ezekb&otilde;l kell fel&eacute;p&iacute;tenie 
mindent. Az ember meg az&eacute;rt van, hogy mindent saj&aacute;t mag&aacute;hoz 
igaz&iacute;tson, &iacute;gy elnevezte az 1-et IGENnek, a 0-t NEMnek. Persze 
van negat&iacute;v logika is, ahol minden ford&iacute;tva van, de ez m&aacute;s 
t&eacute;szta.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Alapvet&otilde; 
ismeret, hogy a tizes rendszerben (ezent&uacute;l DECIM&Aacute;LISan) az egyes 
sz&aacute;mjegyek un. helyi&eacute;rt&eacute;keket foglalnak el. Ezeknek megvan 
a saj&aacute;t &eacute;rt&eacute;k&uuml;k:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6543=6*10^3 
+ 5*10^2 + 4*10^1 + 3*10^0<br>
&nbsp;&nbsp;&nbsp;Vagyis a helyi&eacute;rt&eacute;kek jobbr&oacute;l balra n&otilde;nek 
&eacute;s mindig az el&otilde;z&otilde; 10-szeresei.&nbsp;Bin&aacute;risan is 
ugyan&iacute;gy van, csak ott k&eacute;tszeresek a helyi&eacute;rt&eacute;kek 
&eacute;s csak a 0 &eacute;s 1 sz&aacute;mjegyek haszn&aacute;lhat&oacute;k. 
</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&Iacute;me egy bin&aacute;risan 
le&iacute;rt sz&aacute;m: &nbsp;11010101.<br>
Ugye ez &iacute;gy semmit nem mond. Oke, akkor &aacute;t&iacute;rjuk decim&aacute;lisba:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;11010101 -&gt; &nbsp;1*2^7+1*2^6+0*2^5+1*2^4+0*2^3+1*2^2+0*2^1+1*2^0=213.<br>
&nbsp;&nbsp;&nbsp;Amint l&aacute;that&oacute; egyszer&ucirc;en csak a helyi&eacute;rt&eacute;k&eacute;vel 
szorozgattam az ott l&eacute;v&otilde; sz&aacute;mot. Most persze megk&eacute;rdezed, 
ha &aacute;t kell &iacute;rni akkor mire j&oacute;. Csak arra, hogy megismerd 
a g&eacute;p &quot;gondolkod&aacute;s&aacute;t&quot; &eacute;s egy &uacute;jabb 
sz&aacute;mrendszert. Ez a tizenhatos (16) vagy HEXADECIM&Aacute;LIS rendszer.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Na most ez mire 
j&oacute;? Egy kis matematikai &eacute;rz&eacute;kkel gyorsan l&aacute;that&oacute;, 
hogy a 16 a 2 4-ik hatv&aacute;nya. Ennek seg&iacute;ts&eacute;g&eacute;vel 
n&eacute;gy bin&aacute;ris sz&aacute;mjegyet egyetlen hexa sz&aacute;mjeggyel 
&iacute;rhatunk le. Ehhez persze ismerni kell a hexa sz&aacute;mokat. A 0-9 
tartom&aacute;nyt a hagyom&aacute;nyos 0-9 sz&aacute;mjegyekkel &iacute;rjuk, 
m&iacute;g a 10-15 r&eacute;szt bet&ucirc;kkel jel&ouml;lj&uuml;k. Teh&aacute;t 
10=A, 11=B, 12=C, 13=D, 14=E, 15=F. Most m&aacute;r tudjuk a hexa jegyek &eacute;rt&eacute;k&eacute;t, 
m&aacute;r csak egy p&eacute;lda kell.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az el&otilde;z&otilde; 
p&eacute;lda alapj&aacute;n az 11010101 bin&aacute;ris sz&aacute;mot &iacute;rom 
&aacute;t hex&aacute;ba. El&otilde;sz&ouml;r k&eacute;t n&eacute;gyes csoportot 
gy&aacute;rtunk, ezek 1101 &eacute;s 0101. Ezeknek k&ouml;nny&ucirc; megmondani 
a hexa megfelel&otilde;j&eacute;t, egy kis gyakorl&aacute;s ut&aacute;n mindenkinek 
menni fog. &Iacute;gy 1101 -&gt;D &eacute;s 0101 -&gt;5. Most m&aacute;r le&iacute;rhatjuk 
az &eacute;rt&eacute;ket: D5.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az&eacute;rt haszn&aacute;lj&aacute;k 
a hexa sz&aacute;mokat, mert:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- k&ouml;zel &aacute;llnak a bin&aacute;risokhoz, 
de m&eacute;gsem olyan nehezen megjegyezhet&otilde;ek&nbsp;&eacute;s hossz&uacute;ak<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;- j&oacute;l t&uuml;kr&ouml;zik a g&eacute;p 
bels&otilde; sz&aacute;m&aacute;br&aacute;zol&aacute;s&aacute;t, szemben a decim&aacute;lisokkal</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Egy&eacute;bk&eacute;nt 
megk&eacute;rdezhetn&eacute;tek (ha meg tudn&aacute;tok), hogy honnan l&aacute;tszik 
egy sz&aacute;mr&oacute;l a t&iacute;pusa. Van erre egy jel&ouml;l&eacute;si 
m&oacute;d: a hexa sz&aacute;mok v&eacute;g&eacute;re egy h bet&ucirc; ker&uuml;l, 
a bin&aacute;risak v&eacute;g&eacute;re egy b, m&iacute;g a decim&aacute;lisok 
v&eacute;g&eacute;re egy d. Persze ez csak a hex&aacute;n&aacute;l egy&eacute;rtelm&ucirc;, 
mert h bet&ucirc; m&aacute;shol nincs, de &aacute;ltal&aacute;ban ha egy kilom&eacute;ter 
hossz&uacute; sz&aacute;m v&eacute;g&eacute;n egy b bet&ucirc;t l&aacute;tsz 
&eacute;s a sz&aacute;m csupa 1 &eacute;s 0, akkor az val&oacute;sz&iacute;n&ucirc;leg 
bin&aacute;ris, a decim&aacute;lisok v&eacute;g&eacute;r&otilde;l meg nemes 
egyszer&ucirc;s&eacute;ggel elhagyj&aacute;k a jelet. Van persze egy m&aacute;sik 
m&oacute;d is, ahol a hexa el&eacute; egy $ ker&uuml;l, m&iacute;g a bin&aacute;risok 
el&eacute; egy % (lehet, hogy ez csak a 64-en volt &iacute;gy, a $ most is j&oacute; 
ez biztos). Az assemblerek tov&aacute;bbi heppje, hogy a hexa sz&aacute;mok 
el&eacute; egy felesleges 0-t kell tenni, ha az betñvel kezd&otilde;dik. Ezek 
alapj&aacute;n a 213 az 11010101b vagy 0d5h alakban is &iacute;rhat&oacute;.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Most pedig elmondom, 
mi&eacute;rt nyaggattalak ezekkel. A sz&aacute;m&iacute;t&oacute;g&eacute;pekben 
az inform&aacute;ci&oacute; alapegys&eacute;ge a BIT, ez angol r&ouml;vid&iacute;t&eacute;s 
&eacute;s annyit tesz, hogy BInary digiT, azaz bin&aacute;ris sz&aacute;mjegy. 
Ebb&otilde;l m&aacute;r tudj&aacute;tok, hogy ez csak igen gy&eacute;r inform&aacute;ci&oacute; 
t&aacute;rol&oacute;, mert egy bitnek csak k&eacute;t &aacute;llapota lehet: 
0 vagy 1. Ez&eacute;rt n&eacute;h&aacute;ny bitet &ouml;ssze szok&aacute;s f&ucirc;zni, 
mivel &iacute;gy sokkal t&ouml;bb lehet&otilde;s&eacute;g lesz. A lehet&otilde;s&eacute;gek 
sz&aacute;ma pontosan 2^n, ahol n az &ouml;sszef&ucirc;z&ouml;tt bitek sz&aacute;ma. 
R&eacute;gebben voltak 4 bites procik, ezek 2^4=16 &aacute;llapotot tudtakmegk&uuml;l&ouml;nb&ouml;ztetni. 
Manaps&aacute;g m&aacute;r a legprimit&iacute;vebb proci is 8 bites, de az &aacute;tlagosak 
m&aacute;r 32 bitesek, m&iacute;g a sz&aacute;modra el&eacute;rhet&otilde; legjobbak 
64 biten t&aacute;rolj&aacute;k az adatokat. Persze k&eacute;nyelmetlen mindig 
le&iacute;rni, hogy 8, 16, 32... bites, ez&eacute;rt elnevezt&eacute;k 8 bit 
egy&uuml;ttes&eacute;t bytenak, 16 bit&eacute;t sz&oacute;nak (word, W), 32-&eacute;t 
pedig duplasz&oacute;nak (double word, DW).</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;V&eacute;g&uuml;l 
p&aacute;r sz&oacute; a kettes komplemensr&otilde;l. Csak annyit kell tudnod, 
hogy ilyen alakban &aacute;br&aacute;zolj&aacute;k az el&otilde;jeles sz&aacute;mokat 
a sz&aacute;m&iacute;t&oacute;g&eacute;pen. Az ilyen sz&aacute;mok pont &uacute;gy 
n&eacute;znek ki, mint egy nat&uacute;r bin&aacute;ris sz&aacute;m, csak a kezel&eacute;s&uuml;k 
m&aacute;s. Az adott g&eacute;pi utas&iacute;t&aacute;s d&ouml;nti el, hogy 
a sz&aacute;m kettes komplemensk&eacute;nt vagy sima bin&aacute;ris sz&aacute;mk&eacute;nt 
&eacute;rtelmez&otilde;dik. A kettes kompl. sz&aacute;mokn&aacute;l a legnagyobb 
helyi&eacute;rt&eacute;k&ucirc; bitet elnevezt&eacute;k el&otilde;jelbitnek. 
Ha ez 1 akkor a sz&aacute;m negat&iacute;v, ha 0 akkor pozit&iacute;v. Csakhogy 
nem &aacute;m csak &uacute;gy negat&iacute;v, hogy kisz&aacute;molom a marad&eacute;k 
bitek &eacute;rt&eacute;k&eacute;t &eacute;s el&eacute; rakok egy - jelet. A 
val&oacute;di &eacute;rt&eacute;ket p&eacute;ld&aacute;ul &uacute;gy kapod meg, 
ha kisz&aacute;molod az &eacute;rt&eacute;k&eacute;t sima bin&aacute;risk&eacute;nt 
&eacute;s ebb&otilde;l levonod a sima bin&aacute;risk&eacute;nt lehets&eacute;ges 
legnagyobb<br>
&eacute;rt&eacute;k+1 -et. P&eacute;ld&aacute;ul: 98h az 10011000b, ez kettes 
komplemensk&eacute;nt &eacute;rtelmezve negat&iacute;v &iacute;gy a pontos decim&aacute;lis 
&eacute;rt&eacute;k&eacute;hez 98h-b&oacute;l (152) le kell vonni 0ffh+1-et 
(256). Ez -104, vagyis 98h kettes komplemensk&eacute;nt &eacute;rtelmezve&nbsp;ennyi. 
Ezek ut&aacute;n m&aacute;r vil&aacute;gos, hogy 0ffh az -1 &eacute;s 80h az 
128 &eacute;s 0a6h az -90.</font></p>
<p>&nbsp; 
<table border>
    <tr>
        <td width="126"><p><font face="Comic Sans MS">REGISZTEREK</font></td>
    </tr>
</table>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ezek ut&aacute;n 
k&ouml;vetkezzen a processzor belseje, persze csak annyira amennyire kell. A 
processzorban a sz&aacute;munkra legfontosabb dolgok a REGISZTERek. Ezek bels&otilde; 
t&aacute;rol&oacute;egys&eacute;gek. Ezek t&aacute;rolj&aacute;k a m&ucirc;veletek 
eredm&eacute;nyeit, a m&ucirc;veletek adatait &eacute;s m&eacute;g sok egyebet. 
A regiszterek hossza procit&oacute;l f&uuml;gg&otilde;, a 8086-ban &eacute;s 
a 286-ban 16 bitesek, m&iacute;g a 386-osban &eacute;s a 486-ban 32 bitesek. 
Mivel a 8086 az alapja a PC-nek ez&eacute;rt a 8086 assembly programoz&aacute;s&aacute;t 
fogom taglalni. Persze k&eacute;s&otilde;bb sor ker&uuml;lhet a t&ouml;bbire 
is.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;L&aacute;ssuk teh&aacute;t a 8086 
regisztereit:</font></p>
<ul>
    <p align="left"><font face="Comic Sans MS">- Van 8 darab &aacute;ltal&aacute;nos 
    regiszter, amikben t&aacute;rolhatunk adatot, c&iacute;met vagy amit akarunk. 
    Ezek a regiszterek: AX, BX, CX, DX, SI, DI, BP, SP. Persze ezek k&ouml;z&uuml;l 
    mindnek megvan a saj&aacute;t rendeltet&eacute;se, amit bizonyos utas&iacute;t&aacute;sok 
    eset&eacute;n el kell l&aacute;tnia. Az SP-t jobb nem buzer&aacute;lni mert 
    ez tartalmazza a verem &aacute;llapot&aacute;t (a vermet k&eacute;s&otilde;bb 
    mes&eacute;lem). A t&ouml;bbi &aacute;ll&iacute;tgat&aacute;s&aacute;val 
    nem okozhatunk t&uacute;l nagy bajt, de az&eacute;rt ide&iacute;rom, mi 
    is az alapfunkci&oacute;juk, vagyis honnan kapt&aacute;k a nevÅket.<br> 
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;AX - Accumulator, 
    ez az els&otilde;dleges adatregiszter<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;BX 
    - Base, &aacute;ltal&aacute;ban a b&aacute;zismutat&oacute; az indexelt 
    c&iacute;mz&eacute;sekn&eacute;l<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;CX 
    - Count, ez a sz&aacute;ml&aacute;l&oacute; j&oacute; n&eacute;h&aacute;ny 
    utas&iacute;t&aacute;sban<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;DX 
    - Data, ez a m&aacute;sodlagos adatregiszter<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SI 
    - Source Index, bizonyos string utas&iacute;t&aacute;sokn&aacute;l a forr&aacute;s 
    c&iacute;me<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;DI 
    - Destination Index, ez pedig a c&eacute;l string c&iacute;me<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;BP 
    - Base Pointer, t&aacute;bl&aacute;zatokhoz b&aacute;zismutat&oacute;<br> 
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SP - Stack Pointer, 
    a verem mutat&oacute;ja<br> Persze b&aacute;rmelyiket lehet haszn&aacute;lni 
    m&aacute;sra is ha nagyon kell, csak a proci nem mindegyiket fogadja el 
    egyes helyeken.</font></p>
    <p><font face="Comic Sans MS">- Van 4 darab szegmensregiszter. Ezek az utas&iacute;t&aacute;sok 
    vagy adatok c&iacute;m&eacute;t hat&aacute;rozz&aacute;k meg. A szegment&aacute;l&aacute;st 
    majd elmagyar&aacute;zom r&eacute;szletesen, mert kiss&eacute; k&ouml;r&uuml;lm&eacute;nyes. 
    Ezeknek is van nev&uuml;k.<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;CS 
    - Code Segment, az programk&oacute;d szegmense<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;DS 
    - Data Segment, az els&otilde;dleges adatszegmens<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ES 
    - Extra Segment, v&aacute;laszthat&oacute; adatszegmens<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;SS 
    - Stack Segment, a veremszegmens</font></p>
    <p><font face="Comic Sans MS">- Egy azaz egy darab &aacute;llapotregiszter 
    van, ami az elv&eacute;gzett m&ucirc;velet eredm&eacute;ny&eacute;r&otilde;l 
    ad inform&aacute;ci&oacute;t. Ez is majd k&eacute;s&otilde;bb (p&aacute;r 
    sor) fejtem ki. Ennek a neve FLAG regiszter.</font></p>
    <p><font face="Comic Sans MS">- V&eacute;g&uuml;l, de nem utols&oacute;sorban 
    van egy utas&iacute;t&aacute;smutat&oacute;, ami a CS &aacute;ltal meghat&aacute;rozott 
    szegmensben a k&ouml;vetkez&otilde; utas&iacute;t&aacute;sra mutat. Ennek 
    neve IP azaz Instruction Pointer.</font></p>
</ul>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az AX, BX, CX, DX 
regisztereket a processzor fel tudja bontani k&eacute;t 8 bites, azaz byte hossz&uacute;s&aacute;g&uacute; 
regiszterre. Az als&oacute; byten&aacute;l az X-et L-lel, a fels&otilde; byten&aacute;l 
pedig H-val helyettes&iacute;tik. &iacute;gy az AX k&eacute;t r&eacute;sze AL 
&eacute;s AH, &nbsp;a CX-&eacute; meg CL &eacute;s CH. Ez az&eacute;rt van, 
mert n&eacute;ha csak 8 biten kell a m&ucirc;veletet<br>
elv&eacute;gezni.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Akkor l&aacute;ssuk 
a FLAG regisztert. Mint m&aacute;r mondtam ez a regiszter az elv&eacute;gzett 
m&ucirc;veletek eredm&eacute;ny&eacute;r&otilde;l ad infot. Minden esem&eacute;nyhez 
egy-egy bit van hozz&aacute;rendelve, aminek az 1-re &aacute;ll&iacute;t&aacute;sa 
jelzi, hogy megt&ouml;rt&eacute;nt a dolog. Ezek a bitek a k&ouml;vetkez&otilde;k:</font></p>
<ul>
    <p><font face="Comic Sans MS">CF - Carry Flag, jelzi, hogy volt-e &aacute;tvitel 
    magasabb helyi&eacute;rt&eacute;kre, vagy k&ouml;lcs&ouml;nz&eacute;s alacsonyabb 
    helyi&eacute;rt&eacute;k fel&eacute;. &Aacute;ltal&aacute;ban az aritmetikai 
    m&ucirc;veletek eredm&eacute;ny&eacute;t jelzi. Majd az &ouml;sszead&aacute;s 
    &eacute;s a kivon&aacute;s utas&iacute;t&aacute;sn&aacute;l r&eacute;szletesen 
    le&iacute;rom a szerep&eacute;t. A k&uuml;l&ouml;nb&ouml;z&otilde; megszak&iacute;t&aacute;si 
    f&uuml;ggv&eacute;nyek el&otilde;szeretettel haszn&aacute;lj&aacute;k hibajelz&eacute;sre. 
    Ez a FLAG 0. bitje.</font></p>
    <p><font face="Comic Sans MS">PF - Parity Flag, a parit&aacute;st jelzi. 
    Ha az eredm&eacute;ny p&aacute;ros, akkor egyre &aacute;ll&iacute;t&oacute;dik. 
    Hogy mikor lesz egy eredm&eacute;ny p&aacute;ros? Ha a benne l&eacute;v&otilde; 
    egyesek sz&aacute;ma p&aacute;ros akkor a sz&aacute;m is p&aacute;ros. Ezt 
    hibakeres&eacute;sre lehet haszn&aacute;lni adat&aacute;tviteln&eacute;l. 
    Ez a 2. bit.</font></p>
    <p><font face="Comic Sans MS">AF - Auxiliary carry Flag, ez a seg&eacute;d 
    &aacute;tviteljelz&otilde;. Akkor lesz 1, ha a m&ucirc;velet k&ouml;zben 
    a byte vagy sz&oacute; als&oacute; fel&eacute;r&otilde;l t&ouml;rt&eacute;nt 
    &aacute;tvitel. Ez majd a BCD (Binary Coded Decimal) aritmetik&aacute;n&aacute;l 
    lesz hasznos. Ez vala a 4. bit.</font></p>
    <p><font face="Comic Sans MS">ZF - Zero Flag, akkor lesz egy, ha az eredm&eacute;ny 
    nulla. 6. bit.</font></p>
    <p><font face="Comic Sans MS">SF - Sign Flag, el&otilde;jel bit, ami a m&ucirc;velet 
    eredm&eacute;ny&eacute;nek legmagasabb bitj&eacute;t tartalmazza. Kettes 
    komplemens sz&aacute;mokn&aacute;l ez jelzi az el&otilde;jelet. 7. bit.</font></p>
    <p><font face="Comic Sans MS">TF - Trap Flag, csapda (maradjunk a trapn&aacute;l) 
    jelz&otilde; bit. Debugger programok haszn&aacute;lj&aacute;k el&otilde;szeretettel, 
    mert a proci minden utas&iacute;t&aacute;skor &aacute;tadja a vez&eacute;rl&eacute;st 
    az 1-es megszak&iacute;t&aacute;snak, ha a TF=1. Ez pediglen (ki gondoln&aacute;) 
    a 8. bit.<br> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br> IF - Interrupt enable Flag, 
    ez enged&eacute;lyezi a megszak&iacute;t&aacute;sokat. Ha 1 az &eacute;rt&eacute;ke, 
    akkor a proci figyelembe veszi a hardvermegszak&iacute;t&aacute;sokat (pl.: 
    billenty&ucirc;zet, id&otilde;, soros port ...). ha 0, akkor nem. B&aacute;rmit 
    csin&aacute;lhatsz, az NMI megszak&iacute;t&aacute;sokat mindig elfogadja 
    a proci hiszen ezeknek a neve is Non Maskable Interrupt, azaz nem maszkolhat&oacute;, 
    nem letilthat&oacute;. A szoftvermegszak&iacute;t&aacute;sokat is elfogadja 
    a proci, hiszen ezt te h&iacute;vod tudatosan. Ez meg a 9. bit.</font></p>
    <p><font face="Comic Sans MS">DF - Direction Flag, az ir&aacute;nyjelz&otilde; 
    bit. A sztringm&ucirc;veletek ir&aacute;ny&aacute;t hat&aacute;rozza meg. 
    Ezekr&otilde;l majd k&eacute;s&otilde;bb. 10. bit.</font></p>
    <p><font face="Comic Sans MS">OF - Overflow Flag jelzi a t&uacute;lcsordul&aacute;st. 
    Akkor &aacute;ll&iacute;t&oacute;dik be, ha az eredm&eacute;ny nem f&eacute;r 
    be a c&eacute;lregiszterbe. P&eacute;ld&aacute;ul ha &ouml;sszeadjuk a 7564h 
    &eacute;s a 98b7h sz&aacute;mokat, akkor a v&eacute;geredm&eacute;ny 10ddfh. 
    Ez nem f&eacute;r el 16 biten, ez&eacute;rt a 0ddfh-t t&aacute;roljuk a 
    sz&oacute; hossz£ regiszterben &eacute;s az OF-et 1-re &aacute;ll&iacute;tjuk 
    jelezve, hogy a sz&aacute;m el&eacute; m&eacute;g egy 1-est kell k&eacute;pzelni. 
    Majd k&eacute;s&otilde;bb kider&uuml;l mire j&oacute;. Itt a v&eacute;ge 
    a 11. bittel.</font></p>
</ul>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A FLAG regiszter 
egy&eacute;bk&eacute;nt 16 bites, mint arra m&aacute;r r&aacute;j&ouml;hett&eacute;l. 
A m&eacute;g<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;nem haszn&aacute;lt biteket a k&eacute;s&otilde;bbi 
procik (80286+) haszn&aacute;lj&aacute;k.</font></p>
<p align="left"><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;A k&ouml;vetkez&otilde; 
cikkben egy kicsit szegment&aacute;lunk.</font></p>
<p align="right"><font face="Comic Sans MS">Lucifer of ZeroBit</font></p>
</body>

</html>