<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<title>Assembler rulez 2. r&eacute;sz</title>
<meta name="generator" content="Namo WebEditor v3.0">
<style><!--
-->
</style>
</head>

<body background="bg2.gif" bgcolor="white" text="black" link="blue" vlink="purple"
 alink="red">

<p><font face="Courier">&nbsp;</font></p>
<p><font face="Courier">&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;<br>
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml;&Uacute;&Auml;<br>
&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&Uacute;&Auml;&Auml; 
&nbsp;&Uacute;&Auml;<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute; &nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;ASSEMBLY RULEZ<br>
&Uacute;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml; 
&nbsp;&nbsp;&nbsp;&nbsp;II.r&eacute;sz<br>
&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;&Auml;&Auml;&Auml; 
&nbsp;&nbsp;&nbsp;&Uacute;&Auml; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Uacute;&Auml;</font></p>
<p>&nbsp; 
<table border>
    <tr>
        <td width="103"><p><font face="Comic Sans MS">Szegment&aacute;l&aacute;s 
            </font></td>
    </tr>
</table>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Most pedig k&ouml;vetkezik 
a v&eacute;gzet, a szegment&aacute;l&aacute;s elmagyar&aacute;z&aacute;sa. Ha 
n&eacute;hol kiss&eacute; &eacute;rthetetlen lenn&eacute;k, az&eacute;rt eln&eacute;z&eacute;st 
k&eacute;rek, de ezt neh&eacute;z &iacute;gy &iacute;r&aacute;sban elmagyar&aacute;zni. 
Akinek b&aacute;rmi probl&eacute;m&aacute;ja lenne az &iacute;rjon nekem, a 
c&iacute;mem benne van az &uacute;js&aacute;gban. Miel&otilde;tt b&aacute;rki 
feladn&aacute; olvassa v&eacute;gig ezt a r&eacute;szt, mert lehet, hogy csak 
a v&eacute;g&eacute;n k&ouml;zl&ouml;m, ami nem vil&aacute;gos sz&aacute;modra.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A 8086 procit 20 
darab c&iacute;mvezet&eacute;kkel tervezt&eacute;k, amivel 2^20=1048576 (1MB) 
byte mem&oacute;ria &eacute;rhet&otilde; el. Egy mem&oacute;riarekesz el&eacute;r&eacute;s&eacute;hez 
20 bitre van sz&uuml;ks&eacute;g, mert ezek adj&aacute;k a sz&uuml;ks&eacute;ges 
lehet&otilde;s&eacute;geket az el&eacute;r&eacute;shez. A probl&eacute;ma az 
volt, hogy a regiszterek 16 bitesek voltak &eacute;s nem lett volna el&otilde;ny&ouml;s 
egyes regisztereket 20 bitesre gy&aacute;rtani, mert a proci 16 bitekben gondolkodott 
&eacute;s sz&ouml;rnyen lass&iacute;totta volna a 20 bittel dolgoz&aacute;s. 
Persze megold&aacute;s lett volna, ha az eg&eacute;sz proci 20 bites, de ez 
nem lett volna kompatibilis semmivel, ez&eacute;rt kital&aacute;lt&aacute;k 
a szegment&aacute;l&aacute;st.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A szegment&aacute;l&aacute;s 
l&eacute;nyege, hogy a mem&oacute;ri&aacute;t felosztj&aacute;k 64 KB-os r&eacute;szekre. 
Egy ilyen rendszerben egy byte el&eacute;r&eacute;s&eacute;hez k&eacute;t dolog 
kell: a szegmens kezd&otilde;c&iacute;me &eacute;s a szegmens kezdet&eacute;hez 
viszony&iacute;tott mutat&oacute; (offset). Most &uacute;gy t&ucirc;nhet hogy 
semmit se csin&aacute;ltunk, csak bonyol&iacute;tottuk a helyzetet, hisz a szegmens 
kezdet&eacute;nek t&aacute;rol&aacute;s&aacute;hoz szint&eacute;n 20 bit kell. 
Itt j&ouml;tt a nagy &ouml;tlet &eacute;s azt mondt&aacute;k, hogy szegmens 
CSAK &eacute;s KIZ&Aacute;R&Oacute;LAG 16-tal oszthat&oacute; c&iacute;men kezd&otilde;dhet. 
Ennek nagy el&otilde;nye hogy az 1 MB-os t&aacute;rban &iacute;gy csak 1048576/16= 
65536 szegmens lehet. Igen&aacute;m, de a 65536 a pontosan 2^16 &eacute;s ez 
m&aacute;r elf&eacute;r 16 biten. Ezek ut&aacute;n a szegmensc&iacute;m val&oacute;j&aacute;ban 
nem egy mem&oacute;riac&iacute;met fog jelenteni, hanem egy sorsz&aacute;mot 
amit 16-tal szorozva kapjuk a pontos mem&oacute;riac&iacute;met.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Most mindezt &aacute;t&uuml;ltetj&uuml;k 
a gyakorlatba. A 20 bites c&iacute;m hexadecim&aacute;lisan 5 sz&aacute;mjeggyel 
&iacute;rhat&oacute; le pl.: 3EC5Ah. Egy szegmens csak 16-tal oszthat&oacute; 
c&iacute;men kezd&otilde;dhet, ez&eacute;rt a hexa alakja MINDIG 0-ra v&eacute;gz&otilde;dik 
(ugyanis, minden hexa helyi&eacute;rt&eacute;k 16-szorost &eacute;r. Az els&otilde; 
helyre 0-t &iacute;rva biztos, hogy 16-tal oszthat&oacute; lesz a sz&aacute;m, 
mert minden jegy&eacute;t 16 t&ouml;bbsz&ouml;r&ouml;s&eacute;vel szoroztuk. 
Az els&otilde; hely szorz&oacute;t&eacute;nyez&otilde;je 1, de ha egy tizenhattal 
oszthat&oacute; sz&aacute;mhoz 16-tal nem oszthat&oacute;t adunk, akkor az eredm&eacute;ny 
sem lesz oszthat&oacute;, rem&eacute;lem vil&aacute;gos?!). De ha ez &iacute;gy 
van akkor ez a 0 sim&aacute;n elhagyhat&oacute;, el&eacute;g ha majd a proci 
odak&eacute;pzeli. Nek&uuml;nk pedig marad 4 hexa sz&aacute;mjegy, ami 16 bit.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A szegmens elej&eacute;hez 
viszony&iacute;tott mutat&oacute; (offset) is 16 bites, mert &iacute;gy a 64 
KB hossz&uacute; szegmens minden elem&eacute;t el&eacute;rhetj&uuml;k. A k&eacute;t 
elemb&otilde;l &aacute;ll &ouml;ssze a pontos c&iacute;m. Ez a k&ouml;vetkez&otilde;k&eacute;pp 
jel&ouml;lj&uuml;k:</font></p>
<p><font face="Comic Sans MS">szegmensc&iacute;m:offset p&eacute;ldul 43DCh:06BF5h.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Most m&aacute;r 
csak n&eacute;h&aacute;ny p&eacute;lda hi&aacute;nyzik a sikerhez. Tegy&uuml;k 
fel, hogy &eacute;rdekel melyik byteot jelenti a k&ouml;vetkez&otilde; c&iacute;m:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;37C4h:3D6Ah. Ehhez el&otilde;sz&ouml;r a szegmensc&iacute;met 
kell 16-tal szorozni, ami&nbsp;hexadecim&aacute;lisan nem m&aacute;s, mint egy 
0-t ut&aacute;na &iacute;rni, &iacute;gy a szegmens kezd&otilde;c&iacute;me 
37C40h. Ehhez kell hozz&aacute;adni az offsetet. Ezt a legegyszer&ucirc;bb sz&aacute;mol&oacute;g&eacute;ppel&nbsp;megtenni. 
Akinek nem lenne ilyen g&eacute;pe az elv&eacute;gezheti pap&iacute;ron is (persze&nbsp;vannak 
sz&aacute;mol&oacute;g&eacute;p programok amik tudnak ilyet).<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pap&iacute;ron ugyan&uacute;gy kell csin&aacute;lni, 
mint tizes sz&aacute;mrendszerben, csak a sz&aacute;mjegyekb&otilde;l t&ouml;bb 
van:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;37C40h<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font><font face="Comic Sans MS"><u>&nbsp;+ 
3D6Ah </u></font><font face="Comic Sans MS"><br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3B9AAh</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;Megvan a keresett &eacute;rt&eacute;k, 
ezzel ut&aacute;na elv&eacute;gezhetj&uuml;k amit akarunk.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Kiss&eacute; bonyolultabb, 
mikor egy pontos c&iacute;met akarunk szegment&aacute;lt form&aacute;ba &iacute;rni. 
Ennek egyszer&ucirc; z oka. A szegmensek 16 byteonk&eacute;nt k&ouml;vetik egym&aacute;st&nbsp;&eacute;s 
egy-egy szegmens 65536 byte hossz&uacute;, ez&eacute;rt egy c&iacute;met sokf&eacute;lek&eacute;ppen 
meg&nbsp;lehet adni. Egy lehets&eacute;ges m&oacute;dszert mutatok be, van m&eacute;g 
sok m&aacute;s is.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Alak&iacute;tsuk 
vissza az el&otilde;bb kapott &eacute;rt&eacute;ket, l&aacute;ssuk mi lesz bel&otilde;le.&nbsp;El&otilde;sz&ouml;r 
is v&aacute;gjuk le az abszol&uacute;t c&iacute;m - az el&otilde;bbi p&eacute;ld&aacute;ban 
ez 3B9AAh lett - utols&oacute; sz&aacute;mjegy&eacute;t. Ez a 0Ah sz&aacute;mjegy. 
&iacute;rjunk a hely&eacute;re egy 0-t. Ha most j&oacute;l megn&eacute;zz&uuml;k 
az eredm&eacute;nyt (3B9A0h), akkor l&aacute;thatjuk, hogy pont olyan a sz&aacute;m 
mint a null&aacute;val b&otilde;v&iacute;tett szegmensc&iacute;m. Akkor a 0-t 
nyugodtan el is hagyhatjuk &eacute;s a marad&eacute;kot elnevezz&uuml;k a szegmensc&iacute;mnek. 
Az 0Ah sz&aacute;m pedig az offszet lesz. &iacute;gy a 3B9AAh szegmens:offszet 
alakban &iacute;gy is fel&iacute;rhat&oacute;:<br>
&nbsp;&nbsp;&nbsp;3B9Ah:000Ah. Ez persze m&eacute;g csak nem is hasonl&iacute;t 
az el&otilde;z&otilde; p&eacute;lda kezd&otilde; &eacute;rt&eacute;k&eacute;re 
(37C4h:3D6Ah). Lehet viszont olyan helyzet, ahol egy abszol&uacute;t c&iacute;met 
egy meghat&aacute;rozott szegmensre vonatkoztatva kell felbontani (nem t&uacute;l 
gyakran, de akadhat). legyen ez a szegmens a 37C4h. Ekkor az el&otilde;bb le&iacute;rt 
m&oacute;don felbontjuk el&otilde;sz&ouml;r &uacute;gy, hogy az offszet &eacute;rt&eacute;k 
0Fh-n&aacute;l kisebb legyen (az el&otilde;z&otilde; m&oacute;dszerrel ez mindig 
&iacute;gy lesz). Ezut&aacute;n le kell vonni a k&iacute;v&aacute;nt szegmensc&iacute;met 
(37C4h) az el&otilde;z&otilde; m&oacute;dszerrel kapott szegmensc&iacute;mb&otilde;l 
(3B9Ah). Az &iacute;gy kapott sz&aacute;m - jelen esetben 3D6h - v&eacute;g&eacute;hez 
hozz&aacute;tessz&uuml;k ez els&otilde;&nbsp;l&eacute;p&eacute;sben kapott sz&aacute;mot. 
ezzel megkapjuk a k&iacute;v&aacute;nt szegmensben az offszet c&iacute;met, 
ami itt 3D6Ah. Ezt &ouml;sszehasonl&iacute;tva a kiindul&oacute; p&eacute;lda 
&eacute;rt&eacute;keivel &ouml;r&ouml;mmel mondhatod, hogy visszakaptuk azt 
(37C4h:3D6Ah).</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Egy&eacute;bk&eacute;nt 
mikor egy hexa sz&aacute;m v&eacute;g&eacute;r&otilde;l elvesz&uuml;nk egy sz&aacute;mjegyet, 
az a 16-tal val&oacute; oszt&aacute;s eredm&eacute;nye lesz, az elvett sz&aacute;m 
pedig a marad&eacute;k. Amikor hozz&aacute;illeszt&uuml;nk egy sz&aacute;mjegyet, 
akkor el&otilde;sz&ouml;r 16-tal szorzunk, majd hozz&aacute;adjuk a sz&aacute;mot. 
Ezzel gondolom nem mondtam t&uacute;l nagy &uacute;jdons&aacute;got.</font></p>
<p>&nbsp; 
<table border>
    <tr>
        <td width="67"><p><font face="Comic Sans MS">VEREM</font></td>
    </tr>
</table>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ez egy igaz&aacute;n 
fontos r&eacute;sze az assembly programoz&aacute;snak. Az&eacute;rt &iacute;rom 
ezt, mert magas szint&ucirc; nyelvben ritk&aacute;n tal&aacute;lkozunk a verem 
haszn&aacute;lat&aacute;val. Legfeljebb be&aacute;ll&iacute;tjuk a m&eacute;ret&eacute;t 
oszt kalap. Az assembly ebben is m&aacute;s. Amikor k&uuml;l&ouml;nb&ouml;z&otilde; 
rutinokat &iacute;runk, akkor gyakran kellhet, hogy a regiszterek &eacute;rt&eacute;k&eacute;t 
ne v&aacute;ltoztassuk meg, mert a h&iacute;v&oacute; programr&eacute;sznek 
esetleg m&eacute;g sz&uuml;ks&eacute;ge van r&aacute;juk. M&eacute;g enn&eacute;l 
is fontosabb a verem, mikor rezidens programot &iacute;runk, hiszen ekkor egy 
megszak&iacute;t&aacute;son &uuml;l&uuml;nk rajta, &eacute;s esetleg a legv&aacute;ratlanabb 
pillanatban aktiv&aacute;l&oacute;dhatunk (az &eacute;ppen fut&oacute; program 
sz&aacute;m&aacute;ra v&aacute;ratlanul) &eacute;s ekkor a fut&oacute; proggy 
nem is tudn&aacute; elmenteni a regisztereket, m&iacute;g ez egyszer&ucirc; 
rutinokn&aacute;l lehets&eacute;ges. Ez&eacute;rt nek&uuml;nk kell gondoskodni 
a t&aacute;rol&aacute;sr&oacute;l. Az nem j&oacute; megold&aacute;s, hogy minden 
elmentend&otilde; regiszterhez egy mem&oacute;riar&eacute;szt jel&ouml;l&uuml;nk 
ki, mert ez egyr&eacute;szt pocs&eacute;kolja a mem&oacute;ri&aacute;t, m&aacute;sr&eacute;szt 
- &eacute;s ez a fontosabb, hiszen maga a verem is mem&oacute;ri&aacute;t haszn&aacute;l 
- a sok c&iacute;mke csak &aacute;ttekinthetetlenn&eacute; teszi a programot, 
mert ha nem defini&aacute;lunk minden egyes ment&eacute;shez - &eacute;s ilyen 
ment&eacute;sre nem csak, rutinok elej&eacute;n lehet sz&uuml;ks&eacute;g, hanem 
akkor is, ha ideiglenesen m&aacute;sra kell az adott regiszter &eacute;s m&aacute;s 
regiszterbe nem tudjuk &aacute;tm&aacute;solni, mert az is kell - k&uuml;l&ouml;n 
c&iacute;mk&eacute;t akkor m&eacute;g hamarabb elkavarodunk, m&iacute;g a veremn&eacute;l 
k&ouml;nnyen meg lehet tal&aacute;lni a betev&eacute;s-kiv&eacute;tel p&aacute;rokat. 
Huhh, de sz&eacute;p barokkos mondat volt, sz&eacute;p hossz&uacute;. M&aacute;r 
&eacute;n se &eacute;rtem.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;Na akkor mi is az a verem? 
A verem az verem. Vagyis amit beletesz&uuml;nk, azt addig meg&otilde;rzi am&iacute;g 
ki nem vessz&uuml;k. Amit utolj&aacute;ra beletett&uuml;nk, azt vehetj&uuml;k 
ki bel&otilde;le el&otilde;sz&ouml;r, mint egy igazi veremn&eacute;l. Ezt nevezik 
LIFO (Last In/First Out) t&iacute;pus&uacute; veremnek. A f&otilde; elt&eacute;r&eacute;s 
az igazi vermekt&otilde;l az, hogy ez lefele b&otilde;v&uuml;l. A legel&otilde;sz&ouml;r 
beletett adat a tetej&eacute;n &quot;lebeg&quot;, a t&ouml;bbi pedig ez al&aacute; 
ker&uuml;l sz&eacute;pen sorj&aacute;ban. A veremben l&eacute;v&otilde; helyek 
sorsz&aacute;moz&aacute;sa a verem alj&aacute;t&oacute;l kezd&otilde;dik. A 
veremmutat&oacute; (SP - Stack Pointer) mindig az aktu&aacute;lis els&otilde; 
szabad helyre mutat a verem tetej&eacute;t&otilde;l sz&aacute;m&iacute;tva. 
A k&ouml;vetkez&otilde; kis &aacute;bra mindent megmutat:</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;xxxx 
&nbsp;&lt;- ez a verem teteje, enn&eacute;l feljebb tilos menni<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;yyyy &nbsp;&lt;- egy verembe t&eacute;tel 
ut&aacute;n ide fog mutatni az SP<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;....<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;....<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;xxxx &nbsp;&lt;- ez a verem alja, 
enn&eacute;l lejjebb nem szabad menni, mert akkor&nbsp;m&aacute;s r&eacute;szeket 
&iacute;runk &aacute;t, esetleg a programot, az adatokat,&nbsp;vagy &eacute;ppen 
a DOS-t</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;A verem kezel&eacute;s&eacute;re 
k&eacute;t utas&iacute;t&aacute;s van a PUSH (beletenni) &eacute;s a POP (kivenni).&nbsp;Ezent&uacute;l 
minden &uacute;j utas&iacute;t&aacute;sn&aacute;l le&iacute;rom a haszn&aacute;lat&aacute;t 
is.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;</font><font face="Comic Sans MS"><u>PUSH 
utas&iacute;t&aacute;s (PUSH word onto stack):</u></font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Haszn&aacute;lat: 
&nbsp;PUSH regiszter16/mem&oacute;ria16</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az adat lehet b&aacute;rmilyen 
16 bites regiszter, vagy b&aacute;rmilyen c&iacute;mz&eacute;ssel meghat&aacute;rozott 
mem&oacute;riatartalom. A procit nem &eacute;rdekli, hogy te esetleg csak egy 
byteot akart&aacute;l lenyomni a verembe, mindig egy eg&eacute;sz sz&oacute;t 
fog letenni. Erre figyelni kell, nehogy a kiv&eacute;telkor a sz&oacute; m&aacute;sodik 
tagja is vissza&aacute;ll&iacute;t&oacute;djon, mert esetleg az m&aacute;r m&aacute;st 
tartalmaz. Miut&aacute;n letette a verembe, 2-vel cs&ouml;kkenti SP-t, hogy 
jelezze a verem n&ouml;veked&eacute;s&eacute;t. A PUSH utas&iacute;t&aacute;s 
speci&aacute;lis v&aacute;ltozata a PUSHF, ami a FLAG regiszter tartalm&aacute;t 
helyezi a lyukba. Ez nagyon hasznos, mikor pl egy &ouml;sszehasonl&iacute;t&aacute;s 
eredm&eacute;ny&eacute;t meg kell &otilde;rizni.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;</font><font face="Comic Sans MS"><u>POP 
utas&iacute;t&aacute;s (POP a word from the stack):</u></font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Haszn&aacute;lat: 
&nbsp;POP regiszter16/mem&oacute;ria16</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Az utolj&aacute;ra 
betett sz&oacute;t berakja a 16 bites regiszterbe, vagy a mem&oacute;ria egy 
sz&oacute; r&eacute;sz&eacute;re. Ezut&aacute;n az SP-t 2-vel n&ouml;veli, hogy 
ennek a sz&oacute;nak a helye felszabaduljon. A CS regiszterbe nem lehet POPolni!! 
A POPnak is van FLAG verzi&oacute;ja, a POPF. Ez az SP &aacute;ltal c&iacute;mzett 
sz&oacute;t a veremb&otilde;l a FLAG-be teszi &aacute;t.</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&Eacute;s most egy 
b&oacute;nusz a k&eacute;s&otilde;bbi programokhoz (ha kezd&otilde; vagy &aacute;tugorhatod):<br>
A 8086 m&aacute;shogy hajtja v&eacute;gre a PUSH SP utas&iacute;t&aacute;st, 
mint a fejlettebb procik. A 8086 el&otilde;sz&ouml;r cs&ouml;kkenti SP-t 2-vel, 
ut&aacute;na leteszi a &eacute;rt&eacute;k&eacute;t a verembe, m&iacute;g a 
80286+ procik el&otilde;sz&ouml;r leteszik SP-t a g&ouml;d&ouml;rbe, majd csak 
ezut&aacute;n cs&ouml;kkentik az &eacute;rt&eacute;k&eacute;t. Ezzel a kis k&uuml;l&ouml;nbs&eacute;ggel 
pillanatok alatt el lehet d&ouml;nteni, milyen proci van a g&eacute;pben. Aki 
PUSH SP-t akarja haszn&aacute;lni, az a k&ouml;vetkez&otilde; m&oacute;don teheti, 
hogy minden procin ugyanazt az eredm&eacute;nyt kapja:<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;PUSH BP &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;; 
BP lemegy a g&ouml;d&ouml;rbe<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;MOV BP,SP &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;; 
SP &aacute;tmegy BP-be<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;XCHG BP,[BP] &nbsp;&nbsp;; BP-t kicser&eacute;lj&uuml;k 
az SS:BP &aacute;ltal c&iacute;mzett bytetal, &iacute;gy&nbsp;SP lenn van a 
vermen &eacute;s BP &eacute;rt&eacute;ke is megmaradt</font></p>
<p><font face="Comic Sans MS">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;No j&ouml;jjenek 
a megszak&iacute;t&aacute;sok.</font></p>
<p align="right"><font face="Comic Sans MS">Lucifer of ZeroBit</font></p>
</body>

</html>