<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta name="generator" content=
"HTML Tidy for Windows (vers 14 February 2006), see www.w3.org" />
<meta http-equiv="Content-Type" content=
"text/html; charset=us-ascii" />
<title>Anti AV</title>
<link rel="stylesheet" href="../../css/code.css" type="text/css" />
</head>
<body>
<hr />
<pre>
<b>[+]</b><u>Topic: Paper</u>
<b>[+]</b><u>Von: silentz</u>
<b>[+]</b><u>Return: <a href=
"javascript:history.back()">Paper</a></u>
</pre>
<hr />
<pre>
[Paper] Anti AV
by silentz
for the DarK-CodeZ MAG #2

Vorwort:
Das Tutorial bringt euch n&auml;her wie ihr AVs, hier speziell AntiVir zerst&ouml;rt.
Im grunde ist das alles ganz einfach, sehr einfach.

1. Windows Sicherheitscenter-dienst stoppen
2. AV-dienst stoppen
3. AV-Prozess beenden
4. Imagepath des AVs inner Registry ver&auml;ndern
5. Ordner des AVs l&ouml;schen.
6. Sicherheitscenter anmachen
ggf. 7. Reg-eintr&auml;ge des AVs l&ouml;schen

zu 1. Wieso sollte ich als erstes das Sicherheitscenter deaktivieren?
-Ganz einfach, weil das Sicherheitscenter sofort alarm schl&auml;gt falls ein AV beendet wird.
wenn wir das sicherheitscenter erst beenden, sprich den Dienst, wird/kann eine meldung nicht mehr ausgegeben werden.

zu 2. Wieso den dienst beenden? Das ist auch genauso einfach, weil man erst den Dienst beenden muss bevor man den Prozess beenden kann, sonst spinnt das AV rum, besonders weil sich der Prozess nicht so einfach schlie&Atilde;&Yuml;en l&auml;sst. Man kann ja einfach ma den Taskmanager &ouml;ffnen und versuchen, den Prozess: avgnt.exe zu beenden. Siehe da es geht nicht. Also immer erst den dienst beenden!

zu 3. Nun beenden wir den Prozess, komischerweise l&auml;sst er sich jetzt beenden, und macht garkeine faxen mehr. Das brauchen wir damit wir die exe l&ouml;schen k&ouml;nnen. Denn, falls die exe am laufen ist ist ein l&ouml;schen nicht m&ouml;glich.

zu 4. Nun den imagepath beenden, der Imagepath sorgt f&uuml;r das Ordnungsgem&auml;&szlig;e starten der datei ver&auml;ndern wir ihn auf eine andere (von uns erstellte exe) is dieser nun auch hin&uuml;ber und eine reparatur des AVs is nichmehr m&ouml;glich, genauso wie das starten des AVs.

zu 5. Nun k&ouml;nnen wir einfach den Ordner des AVs l&ouml;schen, auch wenn manche dlls nicht gel&ouml;scht werden, ist das programm nichtmal mehr ann&auml;hernd funktionsf&auml;hig. auch eine Reparatur bring das ganze nicht wieder zum laufen.

zu 6. jetzt starten wir das sicherheitscenter wieder, damit alles m&ouml;glichst unauff&auml;llig ist.

zu 7. man kann jetzt halt noch alle anderen reg-eintr&auml;ge l&ouml;schen oder modifizieren.

anmerkung zu 4. Das ist der Imagepath des Services den das AV braucht. man kann nun einfach eine leere exe erstellen und ihn darauf umleiten. mehr ist eig nicht n&ouml;tig. Der Service ist absolut nichtmehr startbar.

schluss:
So ich hoffe euch hat das Paper geholfen, und vllt hat ja der ein oder andere nach sowas gesucht.
Ich kann nicht versprechen das das alles noch genauso funktioniert, denn ich habe das alles vor nem halben jahr gemacht und benutze jetzt linux.
getestet habe ich das alles auf Windows XP SP2. 
Zu dieser Zeit hat alles Funktioniert ohne Fehler und ohne Probs.

mfg silentz
</pre>
</body>
</html>
